{
    "pageProps": {
      "posts": [
        {
    "slug": "2023-placement-abhinav-agarwal-piramal",
    "content": "\nAbhinav Agarwal, studying in IIT Kanpur as a BS student in ECO will be joining Piramal as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- WorldQuant (Quant)- JPMC (Market trading and structuring)- Qube Research (Quant Researcher)- Navi (Analyst)- Zenon (SDE)- Apollo (DS)\n\n## Insights on the Selection Process\n- Be clear about the role you want to target- Practice more and more questions- Be updated with the latest questions (related to DSA)- Solve Guestimates\n\n##  Preparation Resources\n- For coding – Leetcode, Interviewbit, Codeforces- For probability&statistics – Brainstellar, 50    challenges problem, Cut the Knot\n\n## Advice for students (dos and don’ts)? \nDo s –- Practice more and more depending upon the profile.- Explain thought process while solving the problem during the interview.- Show your dedication for the company and the role.- Give details about yourself to make the interview in your favour.Don’t s –- Don’t mug up and rather focus on the concepts.- Don’t add points in your resume to fill it up. Add genuine points.\n\n",
    "meta": {
      "title": "Abhinav Agarwal: Placed at Piramal",
      "description": "Abhinav Agarwal: Piramal(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Piramal,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-abhinav-d-singh-mckinsey--company",
    "content": "\nAbhinav D Singh , studying in IIT Kanpur as a BT student in AE will be joining McKinsey & Company as Bussiness Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Bain consultant- BCG associate- AnM associate- ADL associate\n\n## Insights on the Selection Process\n- Resume shortlist- Test (ask you to play games)- Buddy interview - 3 rounds: guesstimate, 2 case rounds (case revolves around resume)\n\n##  Preparation Resources\n-Aditya Agarwal-Victor cheng-CIC (beginners’ level)-Lima case book\n\n## Advice for students (dos and don’ts)? \n- All processes are evaluative, be cautioned, be polite and do your best regardless of whether they are evaluative or not- In case your company asks for other shortlists and preference orders, refrain from showingyour inclination or preference towards other companies, instead try reasoning out why you are agood fit in this company rather than others.\n\n",
    "meta": {
      "title": "Abhinav D Singh : Placed at McKinsey & Company",
      "description": "Abhinav D Singh : McKinsey & Company(Bussiness Analyst)",
      "date": "2023-09-14",
      "tags": "Bussiness Analyst,McKinsey & Company,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-abhishek-gurjar-sap-labs",
    "content": "\nAbhishek Gurjar, studying in IIT Kanpur as a BT student in CSE will be joining SAP Labs as Developer Associate. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Oracle- Juniper Networks- Nomura- JLR- Navi- Titan.email\n\n## Insights on the Selection Process\n- Resume Shortlist- Test- InterviewThe interview was online, continuous and approx 2.5 hours long. It consisted of 7 roundswhich were on average 15-20 mins long.All 7 were such as:1) DSA (medium) – Search in a rotated sorted array2) Probability (easy)3) DSA (medium) – Implement stack using vector and array4) System Design – Design TinyURL5) Product Design – Design a refrigerator for kids6) HR round (1)7) HR round (2)Also, in between the rounds, they asked questions from the resume on the projects,internships, technical skills and, they asked some OOPs, and OS questions.\n\n##  Preparation Resources\n- Interviewbit- Leetcode- GeeksforGeeks\n\n## Advice for students (dos and don’ts)? \nDos- If the interview is online, make sure you sound confident and loud.- In software roles, DSA is a must. Utilize your free time and sincerely do coding on adaily basis.- Get exposure of the CS fundamentals like OOPs, OS, Networks and DBMS.- Mock interviews help a lot, take at least 5 mock interviews before your final interview.Don’ts- Don’t specify any skill or project in your resume in which you are not confident.\n\n",
    "meta": {
      "title": "Abhishek Gurjar: Placed at SAP Labs",
      "description": "Abhishek Gurjar: SAP Labs(Developer Associate)",
      "date": "2023-09-14",
      "tags": "Developer Associate,SAP Labs,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-aditi-rakuten-mobile",
    "content": "\nAditi, studying in IIT Kanpur as a BT student in EE will be joining Rakuten Mobile as Multiple Profile. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Highlabs- FinMechanics- NK Securities\n\n## Insights on the Selection Process\n- Be confident.- Process involvement should be there and rather than answering the questionsdirectly, interact with the interviewer, discuss, understand the problem and then take up thatquestion. SQL, DBMS and OOPS all these concepts are important and should be practisedthoroughly.\n\n##  Preparation Resources\n- Interview bit- Leetcode- Brainstellar- 50 challenging problemand puzzles for aptitude\n\n## Advice for students (dos and don’ts)? \n- Practising with your friends would help you know different approaches to a particular question as well as it will keep you motivated and boosted.\n\n",
    "meta": {
      "title": "Aditi: Placed at Rakuten Mobile",
      "description": "Aditi: Rakuten Mobile(Multiple Profile)",
      "date": "2023-09-14",
      "tags": "Multiple Profile,Rakuten Mobile,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-aditya-gupta-square-point-capital",
    "content": "\nAditya Gupta, studying in IIT Kanpur as a BT student in CE will be joining Square Point Capital as Software Developer . Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Sprinklr- Saplabs- Cisco- Finmechanics\n\n## Insights on the Selection Process\n- Interviews are more of a discussion rather than a question-answering session. The interviewswill indeed be stressful try to take small breaks if you want and most interviewers are chillabout it.- Prioritize your companies accordingly – Don’t just sort the companies in decreasing order ofpay.\n\n##  Preparation Resources\n- LEETCODE- INTERVIEWBIT- GEEKSFORGEEKS- Online notes for OS, DBMS, OOPS\n\n## Advice for students (dos and don’ts)? \n- Start early – By starting early you will have enough time to prepare properly and youwill be able to cover the topics on time.- Try before giving up on any skill – I know many people are just giving up on coding, Iwould suggest trying it, giving it a month or so, and even then, if it’s not working foryou and then you can move on to any other skillset.\n\n",
    "meta": {
      "title": "Aditya Gupta: Placed at Square Point Capital",
      "description": "Aditya Gupta: Square Point Capital(Software Developer )",
      "date": "2023-09-14",
      "tags": "Software Developer ,Square Point Capital,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-akarsh-mittal-bain-and-co",
    "content": "\nAkarsh Mittal, studying in IIT Kanpur as a DUAL student in BT-CE, DUAL-ECO will be joining Bain and Co. as Associate Consultant. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- BCG- AnM- ADL- WorldQuant- Finmechanics- American Express\n\n## Insights on the Selection Process\n- Resume shortlist - Buddy allotment to help in interview prep. (Get to know more about the company + case/interview preparation)- Interview process; 2-4 rounds; revolve around case studies and HR questions\n\n##  Preparation Resources\n- Victor Cheng - YouTube videos- Aaditya Agarwal - Youtube playlist- Case Interviews Cracked (CIC) - IITB Casebook- IIMA Casebook- SRCC Case Compendium - highly recommended, includes some interesting cases- Others IITMs casebooks\n\n## Advice for students (dos and don’ts)? \nConsulting:- Make case groups of 2-3 people and practice with them regularly. Once you have confidence, practice with different people- Prepare your resume very well, this includes your internships, projects, extra curricular, and whatever is written on your resume. You should have a story for every point on your resume.- Prepare HR questions very wellImportant:- Get your resume reviewed with as many seniors as possible before submitting it.- Be confident, don’t panic before the interviews, it will all go well!\n\n",
    "meta": {
      "title": "Akarsh Mittal: Placed at Bain and Co.",
      "description": "Akarsh Mittal: Bain and Co.(Associate Consultant)",
      "date": "2023-09-14",
      "tags": "Associate Consultant,Bain and Co.,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-akash-chavan-rakuten-mobile",
    "content": "\nAkash Chavan , studying in IIT Kanpur as a BT student in CSE will be joining Rakuten Mobile  as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSDE profile in- Sprinklr- Piramal- Navi- Walmart- Deal Share\n\n## Insights on the Selection Process\n- ROUND 1:- The interviewer was interested in asking questions on the software developer lifecycle in addition to the technical ones. Additionally, he inquired about my projects andinternship that I had listed on my résumé in generic terms, such as objectives learnings,outcomes etc.- ROUND 2:- It was an HR interview where they were trying to determine whether I wascompatible with the firm, the Japanese culture and whether I could travel to Japan because itwas an international position.\n\n##  Preparation Resources\n- Leetcode- GFG,- Interview Bit,- LinkedIn notes and YouTube videos of ‘Love Babbar’ and Aditya Verma etc mentors\n\n## Advice for students (dos and don’ts)? \nDO’s:-- The purpose of the interview is to determine whether or not you are the best candidate for theposition, so it's crucial to be smart in how you portray yourself to HR experts and speak interms of what they want to hear.- During the interview, do your research on the company and the position.- Show that you havea clear understanding of the company and it's mission and values, and be prepared to talk abouthow your skills and experience align with the job requirements.Don’ts-- If you don't know the answer to a question or are unsure how to respond, don't get stuck andmove on to the next question keeping this one for the future as it's important to keep theconversation flowing and not waste the interviewer's time.\n\n",
    "meta": {
      "title": "Akash Chavan : Placed at Rakuten Mobile ",
      "description": "Akash Chavan : Rakuten Mobile (SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Rakuten Mobile ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-akhila-mudupu-tata-steel",
    "content": "\nAkhila Mudupu, studying in IIT Kanpur as a MT student in MSE will be joining Tata Steel as Management Trainee(R&T). Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Applied materials- Exxon Mobil- Reliance Industries\n\n## Insights on the Selection Process\n- Resume Shortlist- GD- Technical Interview- Managerial & HR interviewThere were 5 people on the panel.They were cool enough to provide some hints which we have to catch with the presence ofmind.Questions from resume: prepare everything that you mentioned in the resumeQuestions from core: Steelmaking, Iron Making, Machine learning, Basics of physicalmetallurgy, Heat treatment, Iron-Carbon diagramThesis: They will ask about how your thesis is related to industrial applications\n\n##  Preparation Resources\n- Revising all the projects that I mentioned in the resume- Preparing thesis basics- For core – Steelmaking, Iron making from Tupkary and physical metallurgy by V.Raghavan- Revising coursework- Make yourself prepared for all kind of HR questions\n\n## Advice for students (dos and don’ts)? \n- Talk clearly and make strong points during GD- Try to deviate from the direction of your interview if you think there are more questions on the topics at which you are not strong- Do not be overconfident during the interview- Do not mention any of the faculty names in the interview unless they ask- Prepare for all the basics of core especially – BF, steel making, Heat treatment,continuous casting- Having knowledge about ML and coding will be a plus point- If you are mentioning any ML projects they may focus more on those projects- Prepare basics of ML, DL, statistics, probability- Do not bluff during the interview if you do not know the answer tell them that you are not able to recall or that you have to study that topic\n\n",
    "meta": {
      "title": "Akhila Mudupu: Placed at Tata Steel",
      "description": "Akhila Mudupu: Tata Steel(Management Trainee(R&T))",
      "date": "2023-09-14",
      "tags": "Management Trainee(R&T),Tata Steel,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-akshat-goyal-mckinsey--company",
    "content": "\nAkshat Goyal , studying in IIT Kanpur as a BT student in MSE will be joining McKinsey & Company as Business Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Sprinklr (APM)\n\n## Insights on the Selection Process\n- Resume Shortlist – A quantification of peaks on your resume- Interview Calls – 3 in number, Personal Experience Interview, Case InterviewThe interview process was quick and crisp, the interviewers were looking for understanding andin-depth structured approach to the most trivial problems and expecting fluid communicationfrom candidates.\n\n##  Preparation Resources\n- Victor Cheng Case Interview Prep Series- Case Interviews Cracked Book- Day 1.0 IITM Casebook- SRCC Case Compendium\n\n## Advice for students (dos and don’ts)? \n- Keep a cool and calm head when approaching consulting interviews- Structuring, structuring all the way!- Presence of mind is a key metric they are looking for\n\n",
    "meta": {
      "title": "Akshat Goyal : Placed at McKinsey & Company",
      "description": "Akshat Goyal : McKinsey & Company(Business Analyst)",
      "date": "2023-09-14",
      "tags": "Business Analyst,McKinsey & Company,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-akshay-kumar-prasad-reliance-industries-limited",
    "content": "\nAkshay kumar Prasad, studying in IIT Kanpur as a MT student in MSE will be joining Reliance Industries Limited as Team Member (RelianceNew Energy) –Battery. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nShortlisted for an interview in- HSBC – profile GAC analyst- Deloitte – profile Analyst - consultingShortlisted for GD in- Tata Steel – profile Management Trainee(R&amp;T)- Exxon Mobil – profile Engineer\n\n## Insights on the Selection Process\n- Resume shortlist- Technical interviewThe interview revolved around the resume. The interviewer asked at least one question about every technical word mentioned in the resume. Since it was for the profile of R&amp;D in batteryoperations, there were a lot of technical questions related to batteries, supercapacitors, and fuel cells. The duration of the interview was around 50 minutes.\n\n##  Preparation Resources\n- Aptitude & reasoning – R.S. Aggarwal- Technical – Metallurgy concepts and questions specific to respective companies\n\n## Advice for students (dos and don’ts)? \n- Allocate enough time for making the resume and have at least some knowledge of every wordwritten in it.\n\n",
    "meta": {
      "title": "Akshay kumar Prasad: Placed at Reliance Industries Limited",
      "description": "Akshay kumar Prasad: Reliance Industries Limited(Team Member (RelianceNew Energy) –Battery)",
      "date": "2023-09-14",
      "tags": "Team Member (RelianceNew Energy) –Battery,Reliance Industries Limited,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-ananya-singh-groww",
    "content": "\nAnanya Singh, studying in IIT Kanpur as a DUAL student in BT-CHE, DUAL-CHE will be joining Groww as Business Associate. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Sprinklr (APM) - Navi- Apollo 247 - Jodo (Product Analyst)- Barclays (Quant)\n\n## Insights on the Selection Process\n- For our year, the first round was supposed to be a deck submission and there was no shortlisting prior to that. Groww provided us with prompts for both APM and BA roles with a little more than a week’s time for submission. We could apply for one of the two profiles and submit our deck for the same.- After that, they took out a shortlist based on the deck submissions. We were provided with a buddy who helped us prepare for what might be asked in the interview. This was supposed to be a non-evaluative interaction.- This was followed by three rounds of interviews which mostly included questions from resume, case study, guesstimates and general HR.\n\n##  Preparation Resources\n- For sample interview questions, refer to the following placement prep material:\nhttps://drive.google.com/drive/folders/1hkrLnbmA0mXom-Ni5QE4WKWLRft4wIPG\n- For Product Preparation:\nhttps://docs.google.com/document/d/1361vh1zuKTrCXR_DH0WVzJ1cBWjMWJHnpSqtg6jwTOs/edit#heading=h.fn8sb02gwdns\n\n## Advice for students (dos and don’ts)? \n- I would just say that the whole process will feel very random many times and it’ll be difficult,but always believe in yourself and keep working. - It helps big time to have a good supportsystem around you!\n\n",
    "meta": {
      "title": "Ananya Singh: Placed at Groww",
      "description": "Ananya Singh: Groww(Business Associate)",
      "date": "2023-09-14",
      "tags": "Business Associate,Groww,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-anirudh-meena-samsung-rd-delhi",
    "content": "\nAnirudh Meena, studying in IIT Kanpur as a BT student in EE will be joining Samsung R&D Delhi as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Walmart (DS)- Edge Verve (SDE)\n\n## Insights on the Selection Process\n- Online Assessment in their own portal which doesn’t allow the use of STL(standard template Libraries)- Technical Interview- HR Round- Initially, they called us into groups of three students and after the introduction, they provided an easy-level DSA-based question and set a timer for five minutes to solve it.- After that, they conducted one on one interviews.- The interviewer discussed the projects that I had mentioned in my resume.- In HR round we basically discussed my internships and why I chose this field and also my life at IITK.\n\n##  Preparation Resources\n- Programming Pathsala for DSA ( it was nice and well-structured)- Striver’s SDE Sheet for last month - DP from Aditya Verma also from Striver ( yt channel - take you forward )- OOPs, SQL, DBMS from Codehelp channel of Love Bubber- Leetcode for Practice Questions and biweekly Contests - Simplilearn YT channel for machine learning\n\n## Advice for students (dos and don’ts)? \n- Choose your resources carefully and stick to them.- Be well-prepared for the HR round by practising frequently asked questions to get started.- Be confident\n\n",
    "meta": {
      "title": "Anirudh Meena: Placed at Samsung R&D Delhi",
      "description": "Anirudh Meena: Samsung R&D Delhi(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Samsung R&D Delhi,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-anubhav-kalyani-sprinklr",
    "content": "\nAnubhav Kalyani, studying in IIT Kanpur as a BT student in CSE will be joining Sprinklr as Product Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Glean (Software Engineer)- Graviton (Software and Quant)- Cohesity (Software Engineer)- Google (Software Engineer)- Quantbox(Software)\n\n## Insights on the Selection Process\n- Online Assessment (Quite Tough) but selection through CSE Branch and those who had performed quite well in the assessment- Round 1- Coding question found on GfG which was done through DP or 2 Pointers- Round 2- Coding Question Based on Trees and Graphs- Round 3- Design a Library System (Done through SQL/Databases)- Round 4- In general another design question but due to lack of time Behavioral round wasconducted.- Round 5 – HR Round\n\n##  Preparation Resources\n- LeetCode (solve many hard and some medium-level problems since they are of thesame type as asked in interviews and online assessments, Some hard problems of DPlike cherry pickup can be done only if solved before on LeetCode or elsewhere.)- Codeforces (use for speed and building confidence for online assessments andimproving the habit of thinking on the spot)- Test from Pclub Archives as many hard problems are repeated from there.- For Quant - Brainstellar and 50 challenging puzzles of probability (Solve many timescompletely)\n\n## Advice for students (dos and don’ts)? \n- You need to keep your friends in constant touch with the SPO team so that there is quick info transfer.- Solve all the popular hard problems of DP from Leetcode.- Since the Placement interviews are one after the other be ready for waking up at odd times or the whole night.- Give contests from Leetcode and Codeforces.  Don’t leave things for the last and start early.- Form a group for discussing coding problems among your friends.- For HFTs start preparing CSE core subjects like Operating Systems and networks and Architecture from the beginning as mostly the entire interview revolves around it.\n\n",
    "meta": {
      "title": "Anubhav Kalyani: Placed at Sprinklr",
      "description": "Anubhav Kalyani: Sprinklr(Product Engineer)",
      "date": "2023-09-14",
      "tags": "Product Engineer,Sprinklr,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-anuj-gupta-texas-instruments",
    "content": "\nAnuj Gupta, studying in IIT Kanpur as a MT student in EE will be joining Texas Instruments as Analog Design Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Aura semiconductors(Analog Engineer)- Qualcomm(Hardware Engineer)- ST Microelectronics (Analog Engineer)- Signal Chip(Analog Engineer)\n\n## Insights on the Selection Process\n- Technical Test- Interview: The interview went on for half an hour. The panellists were interactive. Panellists aid you inovercoming nervousness. Break the ice in the beginning\n\n##  Preparation Resources\n- Chembiyan T RC Circuit And Op-amp analysis lecture series- Prof. Nagendra Krishnapura basic electrical circuit and analog circuit lecture series- Prof. Nagendra Krishnapura Analog IC Design\n\n## Advice for students (dos and don’ts)? \nDos:- Focus only on one profile in electronics (either analog or digital)- Be thorough with RC circuits and Opamps- Give intuitive answers rather than mathematical answers.- Prepare in groups for interviews and discuss questions with peersDon’ts- Don’t use Laplace Transform to give answers.\n\n",
    "meta": {
      "title": "Anuj Gupta: Placed at Texas Instruments",
      "description": "Anuj Gupta: Texas Instruments(Analog Design Engineer)",
      "date": "2023-09-14",
      "tags": "Analog Design Engineer,Texas Instruments,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-anurag-tyagi-walmart-global-tech",
    "content": "\nAnurag Tyagi, studying in IIT Kanpur as a BT student in MSE will be joining Walmart Global Tech as Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Navi (Data Science)- Sprinkler- Indus Insights and analytics\n\n## Insights on the Selection Process\n- Resume shortlisting- Test- InterviewR1- resume basedR2- resume + puzzles + MLR3- Case studyR4- HR manager roundR5- HR\n\n##  Preparation Resources\n- Leetcode- Codeforces- Courses on ML - Towards data science blog- Brainstellar- 50 challenging problems\n\n## Advice for students (dos and don’ts)? \nCoding practice\n\n",
    "meta": {
      "title": "Anurag Tyagi: Placed at Walmart Global Tech",
      "description": "Anurag Tyagi: Walmart Global Tech(Analyst)",
      "date": "2023-09-14",
      "tags": "Analyst,Walmart Global Tech,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-anushka-sreshth-infosys-wongdoody--their-design-vertical",
    "content": "\nAnushka Sreshth, studying in IIT Kanpur as a DUAL student in BT - ME, DUAL - M.DES will be joining Infosys (Wongdoody – their design vertical) as Lead Experience Designer. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Jio (Visual Design Profile)- TCS (UI Design)\n\n## Insights on the Selection Process\n- For Infosys, first, we had to fill out an application form and submit it along with our resumes, followed by a 24-hour design challenge which they used to shortlist the candidates and finally an interview.- There was just one interview for Infosys, where after some introduction, they asked me to mainly walk through my portfolio projects, where they asked at some places to defend mydesign decisions or like what all insights I got through the projects. After that, they asked me to go through the design challenge given by Infosys in a similar manner. The interview lasted about an hour, and that’s it.\n\n##  Preparation Resources\n- Online Articles on the different aspects of UX and UI design.\n\n## Advice for students (dos and don’ts)? \n- Select a good problem statement, first of all, to work on, and make sure every design decision you make has a justification behind it and nothing is just random.- Try to make the visualdesign good and for the design challenges, try to spend good enough time in designing the hi-fi prototypes instead of getting too stuck in the minute details of the rest of the process. Thethe process is important and should be focused on but do not compromise on the finaldeliverables because of that.- Basically, manage time well in such design challenges. - Try to submit interactive prototypes.\n\n",
    "meta": {
      "title": "Anushka Sreshth: Placed at Infosys (Wongdoody – their design vertical)",
      "description": "Anushka Sreshth: Infosys (Wongdoody – their design vertical)(Lead Experience Designer)",
      "date": "2023-09-14",
      "tags": "Lead Experience Designer,Infosys (Wongdoody – their design vertical),Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-arpit-kumar-make-my-trip",
    "content": "\nArpit Kumar, studying in IIT Kanpur as a M.DES student in nan will be joining Make My Trip as User Experience Designer II. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Jio - Seimens - Infosys - TCS\n\n## Insights on the Selection Process\n- Portfolio Shortlisting- First Interview: portfolio and whiteboarding- Final Interview with the VP: portfolio and whiteboarding- They are mainly trying to see your problem-solving skills.- Better the communication skills, better your chances of cracking the interview.- Panel members were quite friendly. They don’t try to impose unnecessary pressure onthe candidate.\n\n##  Preparation Resources\n- YouTube (Design Pilot, Ansh Mehra, etc)- Coursera- Norman Nielsen Group\n\n## Advice for students (dos and don’ts)? \nDo’s:- Prepare a solid portfolio. It’s the most important thing for shortlisting.- Make at least 3 detailed complete UX and UI projects.- Communication skill matters the most in this domain.- Be a problem solver. Try to be creative and empathetic, not mechanical in your approach.Don’ts:- Be clear about which domain you want to pick in design. For e.g., UX, graphic design, game design, etc.- Make separate portfolios for different domains. Try to showcase yourself as an expert in a particular niche.\n\n",
    "meta": {
      "title": "Arpit Kumar: Placed at Make My Trip",
      "description": "Arpit Kumar: Make My Trip(User Experience Designer II)",
      "date": "2023-09-14",
      "tags": "User Experience Designer II,Make My Trip,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-arpit-singh-cohesity",
    "content": "\nArpit Singh, studying in IIT Kanpur as a BT student in CSE will be joining Cohesity as Member of technical staff US role. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Capital-one (SDE)- JPMC (SDE) - Quant-Box (SDE)- World Quant (QR)- Sprinklr (PSE and PE)- Uber (SDE)\n\n## Insights on the Selection Process\n- Resume Shortlist (Yes 8+ for India Role and 9+ for the US role)- Online Test: 2 leetcode easy-medium questions- Interview: 2 rounds (30 min each)\n\n##  Preparation Resources\nnan\n\n## Advice for students (dos and don’ts)? \n- Leetcode - Interviewbit- CSES problem set- Codeforces- Codechef\n\n",
    "meta": {
      "title": "Arpit Singh: Placed at Cohesity",
      "description": "Arpit Singh: Cohesity(Member of technical staff US role)",
      "date": "2023-09-14",
      "tags": "Member of technical staff US role,Cohesity,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-ayush-barnwal-jaguar-land-rover",
    "content": "\nAyush Barnwal, studying in IIT Kanpur as a BT student in CHE will be joining Jaguar Land Rover as Graduate Software Engineer Trainee. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Finmechanics (Associate Consultant)- Navi (Data Analytics)- Tata 1mg (Product Manager)- Sprinklr (Data Science)- Razorpay (Software Engineer)- Indus (Consulting)- Gain Credit (Analyst)\n\n## Insights on the Selection Process\n- Test - The online test had 20 adaptive aptitude questions and two coding questionsand was of around 1.5 hours- Offline Interview\n\n##  Preparation Resources\n- LEETCODE- INTERVIEWBIT - SQLBOLT for SQL- Love Babbar OOPS roadmap- Javapoint\n\n## Advice for students (dos and don’ts)? \n- Try to develop some proficiency in algorithms and their implementation in a language of choice.- Prepare your resume well and should have a thorough knowledge of each and every point present in your resume.- For interviews, try to polish communication skills and temperament. You don’t need to answer every question correctly. Try to do as best as you can.\n\n",
    "meta": {
      "title": "Ayush Barnwal: Placed at Jaguar Land Rover",
      "description": "Ayush Barnwal: Jaguar Land Rover(Graduate Software Engineer Trainee)",
      "date": "2023-09-14",
      "tags": "Graduate Software Engineer Trainee,Jaguar Land Rover,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-ayush-sakya-glean",
    "content": "\nAyush Sakya  , studying in IIT Kanpur as a DOUBLE MAJOR student in CSE will be joining Glean as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Graviton (Quant)- NK Securities (Quant and SDE both)- Sprinklr (SDE both I and II)\n\n## Insights on the Selection Process\n- Resume Shortlist:- Cse only (9.5+ GPA)- No test no Gd- Three Rounds of Technical Interviews of about 45 min each with one main programming question and optimizing it further.- Other than this, round 1 also consisted of 1-word DSA questions like which STL can do x in y time complexity.\n\n##  Preparation Resources\n- Standard Leetcode, GFG and interview Bit questions- Codeforces and Atcoders contest- Test series from Archives by Pclub IITK\n\n## Advice for students (dos and don’ts)? \nDo:- Given that all of the rounds were technical rounds, communication was a differentiator- Maintain a sturdy foundation; it will always be useful.- Keep Giving contests on a regular basis as it helps in timing sense as well as finding approaches for new questionsDon’ts : - Don't respond in a hurry, Consider your response before speaking, and check with the interviewer your approaches before proceeding to code.\n\n",
    "meta": {
      "title": "Ayush Sakya  : Placed at Glean",
      "description": "Ayush Sakya  : Glean(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Glean,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-bhavika-rangwani-j-p-morgan-and-chase",
    "content": "\nBHAVIKA RANGWANI, studying in IIT Kanpur as a BS student in ECO will be joining J P Morgan and Chase as Market Research Analytics. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n-ADL (Resume basis)-Amex (Analytics)-Barclays (Data Scientist/ Analyst)\n\n## Insights on the Selection Process\nResume shortlisting was 8+ cpi for the TestTest –4 Sections:- Finance- Aptitude – Analytics Vidya, Cat Online Papers (Spo Mock Test )- Maths- JEE Maths- EnglishConstraints on Time, Level was Easy to MediumOpen for all\n\n##  Preparation Resources\n- Puzzles- Brain Steller, GFG, 50 Challenging Problems- DSA- (Not CP)- Algorithms were focused – Python was in focus- Finance- Financial Economics and Financial Econometrics(Course- IITK Semester)- Online Resource:- DSA Striver Series\n\n## Advice for students (dos and don’ts)? \nDos: - Resume Clearance, Mock Interviews within the Friend Circle.- Preparation in The Summer- Have a Similar Friend Circle- Courses should not be heavy. If you are taking such make sure it helps in the role you prepare for.- Finance Related ProjectsDon’ts:- Less focus on PORs- Finance Roles, Data Science and Analytics type of Roles don’t focus much on CP\n\n",
    "meta": {
      "title": "BHAVIKA RANGWANI: Placed at J P Morgan and Chase",
      "description": "BHAVIKA RANGWANI: J P Morgan and Chase(Market Research Analytics)",
      "date": "2023-09-14",
      "tags": "Market Research Analytics,J P Morgan and Chase,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-chinmayee-phalak-oracle",
    "content": "\nChinmayee Phalak, studying in IIT Kanpur as a BT student in EE will be joining Oracle as SDE. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Oracle (Member of Technical Staff)- Plutus (Quantitative Analyst)- Sprinklr (Data Scientist)- Zomato (Software Development Engineer)- Jaguar Land Rover India Limited (Graduate Software Engineer Trainee)- SAP Labs (Developer Associate -Central Business Configuration)- Standard Chartered (Development Engineer)- O9 Solutions (Associate Software Engineer)\n\n## Insights on the Selection Process\n- Technical Test : (90 minutes)Types of questions asked : - Coding Questions (easy to moderate) - SQL based  - Rest API based- 4 Interview Rounds : - 1 st and 2 nd rounds were Technical Rounds - Coding Questions (easy to moderate and each to be solved in 10-15 minutes) - SQL query-based questions - OOPs (detailed discussion) - 3 rd round was Resume Based - 4 th round was HR Round\n\n##  Preparation Resources\n- Leetcode: You should practise at least 300-350 Leetcode questions throughout your placement preparation to get a good grip on coding concepts.- Solve Leetcode study plans ( it covers almost all categories of questions)- Mostly DP, Graphs and Greedy questions were asked in the technicaltests.- 50 Challenging Questions- Brainstellar- Leetcode contests to get an idea of the technical coding rounds- Detailed OOPs from GeeksforGeeks- HackerRank for SQL practise- InterviewBit\n\n## Advice for students (dos and don’ts)? \n- Start your preparation as early as possible. Be consistent in solving atleast 5coding questions daily.- Note down the questions which you find difficult to understand and revise themfrequently.- Practise solving coding questions while explaining them verbally, it will help youprepare for the coding rounds during the interviews- Try to keep your mental as well as physical health stable. Take proper sleep.Stay motivated.- Stay confident in the interviews while keeping a light smile on your face.- Do not put too many projects and internships in the resume, just put theimpactful projects, and try to be thorough with each and every elementmentioned in the resume- Contact seniors if you need any help regarding your resume as well as placementpreparation\n\n",
    "meta": {
      "title": "Chinmayee Phalak: Placed at Oracle",
      "description": "Chinmayee Phalak: Oracle(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Oracle,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-deepak-kumar-samsung-noida",
    "content": "\nDeepak Kumar , studying in IIT Kanpur as a MT student in CSE will be joining Samsung Noida as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSDE roles in:- SAP Labs- Navi- Samsung Delhi/Bangalore\n\n## Insights on the Selection Process\n- Resume Shortlist- CSE and MTH (Both BT and MT), 7.5+ gpa- Test – A 3 hrs long test with 1 coding question on Multi-source BFS and had 50 test cases in which you advance to interview only if you solve all 50 test cases\n\n##  Preparation Resources\n- Striver SDE sheet- Fraz SDE sheet- Leetcode and GFG- Do solve previous year's company questions as they are conceptually repeated every year\n\n## Advice for students (dos and don’ts)? \n- Show the HR representative that you have a genuine interest in the business by showing thatyou are well-versed in its past and history.- Avoid being too candid when responding to questions about whether you would leave the jobfor a higher salary.\n\n",
    "meta": {
      "title": "Deepak Kumar : Placed at Samsung Noida",
      "description": "Deepak Kumar : Samsung Noida(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Samsung Noida,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-deepanshu-bisht-bajaj-auto-ltd",
    "content": "\nDeepanshu Bisht, studying in IIT Kanpur as a MS(R) student in ME will be joining Bajaj Auto Ltd. as PGET. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Quest global (Sr. Engineer)\n\n## Insights on the Selection Process\n- Online test, 58 students from all streams selected for an interview- Technical interview - HR Interview- Interview round will consist of a Technical round followed by an HR round. The technical round will have 4 panels. Some panels were specifically for the operations dept, while some were for R&D. So it depends on your luck which panel you get, so prepare for both.\n\n##  Preparation Resources\n- If you have your GATE syllabus basics strong and little advanced knowledge it's good enough.- It is important to give practical answers, to-the-point answers.- Also went through some introductory videos from NPTEL on electric vehicles as they were also hiring for the Chetak division this year.\n\n## Advice for students (dos and don’ts)? \n- Be practical, precise in your answers. - Must go through the company website thoroughly. See what they are looking for that particular year. - Some focus on EV is good.\n\n",
    "meta": {
      "title": "Deepanshu Bisht: Placed at Bajaj Auto Ltd.",
      "description": "Deepanshu Bisht: Bajaj Auto Ltd.(PGET)",
      "date": "2023-09-14",
      "tags": "PGET,Bajaj Auto Ltd.,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-deshanki-singhal-groww",
    "content": "\nDeshanki Singhal, studying in IIT Kanpur as a BS student in CHM will be joining Groww as Assocate Product Manager. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n- Barclays (Associate Data Scientist)\n\n## Insights on the Selection Process\n- A problem statement was given and we had to submit a Google doc as our soln.- Candidates were shortlisted on the basis of the deck submission and resume.- Interviews (2 or 3 rounds depending upon candidate)\n\n##  Preparation Resources\n- Books:\n - Decode and Conquer (Lewis C. Lin)\n - Cracking the PM Interviews (Gayle Laakmann McDowell)\n - Swipe to Unlock\n - Different casebooks\n\n- Websites:\n - Exponent : https://www.tryexponent.com/questions\n - PM exercises: https://www.productmanagementexercises.com/interview-questions\n- Youtube Links :\n - PM School: https://www.youtube.com/watch?v=X4ohobzELAY&amp;list=PLqtwvdE26B_TzYjZf4dMn7RI7qsmbRT-4\n - Exponent: https://www.youtube.com/@tryexponent/playlists\n\n## Advice for students (dos and don’ts)? \nBefore interview :- Prepare resume points (especially highlighted) well- Practice cases as much as you can- Don’t mug up things, go for concepts- Prepare basic repetitive questions beforehand.- Research a bit about company before interview.During Interview –- Be confident and composed. Try to enjoy the interview process- Have a two-way convo with the interviewer rather than a QnA.- Take time but think out loud your solutions.- Ask the interviewer some check-in questions, keep giving mini summaries in longanswers and cases in order to keep the interview interactive.\n\n",
    "meta": {
      "title": "Deshanki Singhal: Placed at Groww",
      "description": "Deshanki Singhal: Groww(Assocate Product Manager)",
      "date": "2023-09-14",
      "tags": "Assocate Product Manager,Groww,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-divyansh-garg-squarepoint-capital",
    "content": "\nDivyansh Garg, studying in IIT Kanpur as a BT student in CSE will be joining SquarePoint Capital as Infrastructure Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Graviton (Software Engineer) - JP Morgan (Full-Time Analyst) - NK Securities (Software Engineer)\n\n## Insights on the Selection Process\n- There was first resume shortlist done, followed by an online test in which questions from- Bash and Docker were asked. (Basic Linux bash scripts). Finally, we had interviews.- The interviews were conducted in three rounds. All three interviews were technical. The third interview was with the team manager, so some HR questions type were asked.- The questions asked were fundamental and were related to networking, cryptography, and OS fields. We were not expected to give a precise answer, instead based on your knowledge, youcan form the answers out of thin air.\n\n##  Preparation Resources\n- Leetcode- CP algorithms ((https://cp-algorithms.com/))- Brainstellar\n\n## Advice for students (dos and don’ts)? \n- Start your preparations early. Stay calm. Code Hard.- Solve Inter IIT doc questions of all companies.- Do not put too many projects/interns in your resume, just put the impactfulprojects/internships, and go through every single term in your resume.\n\n",
    "meta": {
      "title": "Divyansh Garg: Placed at SquarePoint Capital",
      "description": "Divyansh Garg: SquarePoint Capital(Infrastructure Engineer)",
      "date": "2023-09-14",
      "tags": "Infrastructure Engineer,SquarePoint Capital,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-faizan-ahmad-shah-jlr",
    "content": "\nFaizan Ahmad Shah, studying in IIT Kanpur as a BT student in ME will be joining JLR as Mechatronics profile. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- PPT - Aptitude test - Interview- 1.5 hrs Interview. 5 people in the panel. Questions about the company were asked, which were thesame questions from ppt.\n\n## Insights on the Selection Process\n- Class notes for theoretical questions. - For learning about automobile systems, refer to youtubemajorly. - Can refer to any good book for aptitude-related questions.\n\n##  Preparation Resources\n- Target single profile for prep, the main part is your C.V. Build CV according to the targeted profile. - HR round questions should be revised again and again. - Talk to seniors who have experience in your target job profile.\n\n## Advice for students (dos and don’ts)? \nnan\n\n",
    "meta": {
      "title": "Faizan Ahmad Shah: Placed at JLR",
      "description": "Faizan Ahmad Shah: JLR(Mechatronics profile)",
      "date": "2023-09-14",
      "tags": "Mechatronics profile,JLR,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-gaurav-chauhan-hilabs",
    "content": "\nGaurav Chauhan, studying in IIT Kanpur as a BT student in AE  will be joining Hilabs as Data Scientist. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Wells Fargo (Program Associate)- Barclays (Associate Data Scientist)- Walmart (Data Analyst)- Navi (DS)- Navi (Analytics)\n\n## Insights on the Selection Process\n- There was a single-round test consisting of Machine learning, Prob and stats, and aptitude MCQ.- The interview consisted of 3 rounds, and each took around 1 hour.- In the first round, they mostly asked theoretical kind of questions from machine learning. Then moved to the resume and asked to explain the projects, questioning the highlightedterminologies in detail. In the end, they also asked 3 medium-level puzzles (I answered only 2 of them)- The second round was the coding round. 2 medium-level DSA questions, one was based on the use of the hash table, other was a simple graph question. 2 SQL questions ( I answered just one of them).- In the third round, there was not any particular question, it was mostly a discussion. They gave some conditions on Xgboost vs Random forest and then sequentially followed thediscussion by giving various cases.\n\n##  Preparation Resources\n- Leetcode and GFG for coding and other concepts of DSA.- SQLZOO for practising SQL.- GFG and Brainstellar for puzzles.- There weren’t any particular resources for ML. various articles, club projects, GitHublinks, and Andrew Ng Coursera courses. I find the lecture notes of the data mining course quiteuseful.- Probabilitycourse.com for prob and stats.\n\n## Advice for students (dos and don’ts)? \n- Even though you are opting for the data-based role, practice coding regularly.- In almost every data-based role they will ask SQL in tests and interviews, and it doesn’ttake a lot of time to get decent knowledge of SQL, so don’t skip it.- Whatever you do, be consistent. Rather than preparing a lot for some days and skipping on others, be consistent and prepare a decent amount regularly.- Make a good resume and intro, and be ready to explain every point written on it.- Make a proper plan for the preparation and stick to it religiously. Randomly wandering on different things will not help you much.\n\n",
    "meta": {
      "title": "Gaurav Chauhan: Placed at Hilabs",
      "description": "Gaurav Chauhan: Hilabs(Data Scientist)",
      "date": "2023-09-14",
      "tags": "Data Scientist,Hilabs,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-gedala-sai-praveen-signal-chip",
    "content": "\nGedala Sai Praveen, studying in IIT Kanpur as a MT  student in EE will be joining Signal Chip as Analog and RF designer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n- Texas Instruments ( Analog design)- Qualcomm (RF IC Designer)- Intel ( Digital Designer)\n\n## Insights on the Selection Process\n- Technical Interview: Questions on Basic electrical engineering. The interview was interactive and the panelist was helpful. Panellists gave time for solving problems\n\n##  Preparation Resources\n- Himanshu Agarwal (Youtube playlist)- GATE PYQs\n\n## Advice for students (dos and don’ts)? \nDos:- For analog profile, students’ approach for problems must not be mathematical butintuitive.- Do not worry about proficiency in language.- Be thorough about the projects you write in your resumeDon’ts:- Do not reveal the preference order of your companies in other companies’ interviews\n\n",
    "meta": {
      "title": "Gedala Sai Praveen: Placed at Signal Chip",
      "description": "Gedala Sai Praveen: Signal Chip(Analog and RF designer)",
      "date": "2023-09-14",
      "tags": "Analog and RF designer,Signal Chip,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-ghanshyam-prashant-waindeshkar-navi",
    "content": "\nGhanshyam Prashant Waindeshkar, studying in IIT Kanpur as a BS student in ECO will be joining Navi as Product Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nAssociate Consultant – Bain &amp; CompanyBusiness Analyst – Mckinsey &amp; Company\n\n## Insights on the Selection Process\nThe interview process for Navi was pretty straight forward. They released an interviewshortlist based on the resumes (for other profiles they conducted tests) and then there werethree rounds of interviews. Despite interviewing a lot of candidates, the company offered jobto only two candidates so, the number of candidates that were able to convert the interviewinto an offer were very low, and this was same for all the profiles for which the company cameto hire. If I can recall correctly around 35-50 students interviewed for the product profile andonly two of them received the offer, the company gave a total of seven offers across all theprofile.From what I could make-up they had a very high expectations from the candidates, they werelooking for someone who had a really strong profile and also the required fundamentals forthe job.\n\n##  Preparation Resources\nIITB Casebook, IITM Casebook, SRCC casebook, Victor Cheng YouTube album on casesolving.\n\n## Advice for students (dos and don’ts)? \n1. Strong Profile: Talk to as much seniors as possible, try to understand what thecompanies that you are targeting are looking for in the candidates and ideally yourresume should check all those boxes. (Like in case of consulting and productcompanies look for candidates with good academic records, internships, extra-curricular achievements, Position of responsibility etc.).2. Resume: Making resume is an iterative process and you should never stop workingon it till the date of submission comes. Resumes are what you can consider your firstimpression in front of the recruiters, so its only fair that you invest a decent amount oftime on it.Identify seniors and alums that are working in the companies that you are targetingand try to get multiple reviews from them. A good way to do this is uploading multiplecopies of a single draft of resume on google drive and sending each copy to aparticular senior and they can give you specific review by using the comment features.3. Interview preparation: After securing an interview, everything boils down to twothings (i) Your preparations and (ii) Communication Skills.For product and consulting related profiles you should try to form two case prepgroups of three member each. One should have students who you think are startingwith the same level of preparation as you and in the another you should practice withstudent who are a little ahead in the preparations. There are endless resourcesavailable online so I won’t go into what exactly you should prepare.\n\n",
    "meta": {
      "title": "Ghanshyam Prashant Waindeshkar: Placed at Navi",
      "description": "Ghanshyam Prashant Waindeshkar: Navi(Product Analyst)",
      "date": "2023-09-14",
      "tags": "Product Analyst,Navi,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-harsh-mishra-jp-morgan-chase",
    "content": "\nHarsh Mishra, studying in IIT Kanpur as a BT-MT student in MSE  will be joining JP Morgan Chase as Focused Analytics Solution Team (FAST). Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nAxtria, Auronova , Gain credit, Zenon analytics , Groww – BA , Apollo - Product analyst,Trinity life sciences - Associate , Indus insights, SLB – Field Engineer, Barclays - BA ,Applied materials – Application Engineer, FPL – Data Scientist, etc.\n\n## Insights on the Selection Process\nThere were three rounds of interview, before the first round a case study problem was sent bycompany in advance for the candidates to prepare and present the solution during theinterview.The first round involved the given case study, basic questions on ML, probability, puzzles,statistical models etc.The second round revolved around my resume and basic concepts of economics.The third round was an HR round.\n\n##  Preparation Resources\n1. ML - StatQuest YouTube channel , towardsdatascience.com2. SQL – InterviewBit , sql-practice.com3. Puzzles and Probability – Brainstellar, Braingle Probability, Geeks for Geeks, 50challenging problems4. Case studies – IIM A/B casebook, FMS Delhi case book\n\n## Advice for students (dos and don’ts)? \nPrepare your resume thoroughly and conduct multiple mock interviews with your friends. Alsotry to learn a bit about the company and the role you are targeting by talking to seniors, thisway you would be able to answer some interview questions like why this company/ role , etcin a more detailed manner.\n\n",
    "meta": {
      "title": "Harsh Mishra: Placed at JP Morgan Chase",
      "description": "Harsh Mishra: JP Morgan Chase(Focused Analytics Solution Team (FAST))",
      "date": "2023-09-14",
      "tags": "Focused Analytics Solution Team (FAST),JP Morgan Chase,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-hem-shah-nomura",
    "content": "\nHem Shah, studying in IIT Kanpur as a BT student in MSE  will be joining Nomura  as Global Markets Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nDA Vinci (Quant Researcher)Titan.Email (SDE)Wells Fargo (SDE)Zomato (SDE)\n\n## Insights on the Selection Process\nInterview Round 1:Panel judged by 2 people mainly focusing on knowledge in the finance and derivatives trading. Also focused on the resume, finding correlations between the resume and the applied job.Interview Round 2:Panel judged by 2 people focusing on resume and puzzle solving. Be prepared for any cross questioning based on the resume. Puzzle solving involves guestimates, finding expectation problems as well common interview puzzlesHR Round:General HR questions, you should certainly have a good idea about the company you are interviewing for.General knowledge 1. Off campus efforts : You can polish your interview skills by applying for off campus positions for similar roles, which gives a great edge on the question asked in any interview. 2. Be prepared: You need to be ready for any situation outside as well as inside the interview.For eg: We were told the interviews for Nomura will be online on Day 1.1 but the whole recruiting team came at 6 in the morning for conducting it offline. 3. Interview mentality: Be confident and ready for anything. Also do not make up stuff that you cannot back up later-on in the interview \n\n##  Preparation Resources\n MSO201: Probability and StatisticsXifeng_Zhou: Practical Guide to Quant50 Challenging Problems (Questions asked in many quant interviewsFor SDE PrepCodeforces/Codechef/Atcoder (Practice Competitive Programming) on any online judgeInterview BitCSES Problem SetStriver Playlists (TakeUForward)GeneralGeneral YoutubeGFG/IB PuzzlesFriends/Seniors \n\n## Advice for students (dos and don’ts)? \nDo'sPrioritize the profiles that you choose to apply. Also keep options open in the same industry like SDE and Data Science Before sitting in any profiles for placements, it is advisable to do an internship irrespective of profiles being the same as an internship depicts that a person is able to work in a corporate setting.Get you resume reviewed by as many people as possible. It is helpful to take ideas from different seniors/current employees regarding highlighting what the interviewer might be looking for as well as removing errors.Highly advisable to perform pair programming for SDE prep and case solving with other aspirants for consulting jobs.Don’tsDon’t aim for profiles in different industries like Tech as well as Consulting. Even I made my choice to go for Tech/Quant like 2 months before the interviews which highly affected my preparation Don’t work based on someone else’s placement goal, chart your own path to avoid distractions from diverting to the resources that others follow.\n\n",
    "meta": {
      "title": "Hem Shah: Placed at Nomura ",
      "description": "Hem Shah: Nomura (Global Markets Analyst)",
      "date": "2023-09-14",
      "tags": "Global Markets Analyst,Nomura ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-jahnvi-tripathi-barclays",
    "content": "\nJahnvi Tripathi, studying in IIT Kanpur as a BT student in MSE  will be joining Barclays as Associate Data Scientist. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nAmerican Express- AnalystJP Morgan- MarketsCapital One- Business Analyst\n\n## Insights on the Selection Process\nThere were 2 rounds, in the first round there were mix of Data Science and Business Analystquantitative type questions to reach a decision.In the 2 nd round there were questions based on SQL and some HR questions and I had toconvince them why I wouldn’t do MBA and choose Barclays. There were some situationbased questions. There were some casual questions as well.Other than that they asked about my skills but didn’t ask questions related to it.There were questions on my internship as well and they asked me why didn’t get a PPO.\n\n##  Preparation Resources\nCoding: Hackerrank. Interviewbit (Puzzles, Coding and Probability)Puzzles: Brainstellar, 50 challenging problems in probability.HR Round: SPO resourcesPrepared well on my personal introduction.SQL: Youtube videos, did a course on Udemy and solved problems on Geeks for Geeks andInterviewbit.Finance: InvestopediaAptitude: Prepleaf and CAT questions\n\n## Advice for students (dos and don’ts)? \nDos: Do have a look at notes of the course IME634/MSO201 for statistics, do prepare yourintroduction and resume very well and prepare well on the projects written in the resume andtopics related to it and have proper rest before your interviews. Be real and confident. Readabout the company before going for the interview.Don’ts: Never bluff on your resume if you get caught it would create a very negative impact.\n\n",
    "meta": {
      "title": "Jahnvi Tripathi: Placed at Barclays",
      "description": "Jahnvi Tripathi: Barclays(Associate Data Scientist)",
      "date": "2023-09-14",
      "tags": "Associate Data Scientist,Barclays,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-jai-wason-barclays-bank",
    "content": "\nJai Wason, studying in IIT Kanpur as a MT  student in IME will be joining Barclays Bank as Bussiness Analyst . Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nNavi – Data Analyst and Data ScientistJPMC – Focused Analytics Solution TeamAccenture Solutions – Senior Data AnalystApollo 247 – Data ScientistCitiBank – Business Analyst\n\n## Insights on the Selection Process\nBoth interviews were Technical + HR. First was Technical dominated and Second was HRdominated.\n\n##  Preparation Resources\nnan\n\n## Advice for students (dos and don’ts)? \nDos: (i) Be thorough with Resume and be able to defend everything in the Resume.(ii) Know about the background of the company you are sitting for.(iii) mention profile relevant projects.DON’Ts: (i) You should not write anything in Resume which you are not sure of.(ii) Always prepare a question to ask in the end of the interview.\n\n",
    "meta": {
      "title": "Jai Wason: Placed at Barclays Bank",
      "description": "Jai Wason: Barclays Bank(Bussiness Analyst )",
      "date": "2023-09-14",
      "tags": "Bussiness Analyst ,Barclays Bank,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-jatin-garg-capital-one",
    "content": "\nJatin Garg, studying in IIT Kanpur as a BT student in ME will be joining Capital One as Software Engineering. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1. Walmart – Data Analyst2. Piramal Group – GET3. Navi – Data Science4. Standard Chartered – Development Engineer\n\n## Insights on the Selection Process\nThere were two Interview rounds. The first one was purely technical. I was asked toexplain the two coding case study questions. The second was technical + behavioral. IWas asked to describe any project from my internship and some behavioral HRquestions.\n\n##  Preparation Resources\n1. Interviewbit2. Leetcode3. https://cp-algorithms.com/4. ESO207 Lecture Notes(Data Structure and Algorithms)5. 50 Challenging Problems (Puzzles)6. Brainstellar(Puzzles)\n\n## Advice for students (dos and don’ts)? \nDos:1. Prepare your resume very carefully. I suggest everyone review the previous year&#39;sresumes to get an idea. Be ready to defend everything written on it. Also, get itreviewed by at least 6-7 seniors.2. Have a prep partner. Practicing with your friends will also help you learn differentapproaches to a question.3. Do well research about the company in which you are going to interviewDon’ts:1. Don&#39;t stress out, and keep calm.\n\n",
    "meta": {
      "title": "Jatin Garg: Placed at Capital One",
      "description": "Jatin Garg: Capital One(Software Engineering)",
      "date": "2023-09-14",
      "tags": "Software Engineering,Capital One,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-jeet-sarangi-juniper-networks",
    "content": "\nJeet Sarangi, studying in IIT Kanpur as a MT  student in CSE  will be joining Juniper Networks as Software Engineer 2. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSamsung Research Institute Bangalore\n\n## Insights on the Selection Process\nThe Interview was conducted in 4 round :Round1 – Started with Resume based questions, Then they asked two coding problemswhich you need to solve on any online compiler and also some OS basics questions areasked.Round2 – Coding question was asked which you need to solve only using bitwise operators,Some Computer Network basics and OS basics asked.Round3 – C++ and OOPs based questions were asked which were easy level and Some HRbased questions are asked.Round4 – It was kind of formality round hobbies and interest were discussed.\n\n##  Preparation Resources\nGeeksforGeeks,Interview Bit,Leetcode\n\n## Advice for students (dos and don’ts)? \nCoding preparation strategy is different for OA rounds and interviews. Generally in interviewsstandard questions were asked but you are expected to remember and tell differentapproached in interviews So, preparation strategy should be different for both exams.Revisestandard questions for interview.\n\n",
    "meta": {
      "title": "Jeet Sarangi: Placed at Juniper Networks",
      "description": "Jeet Sarangi: Juniper Networks(Software Engineer 2)",
      "date": "2023-09-14",
      "tags": "Software Engineer 2,Juniper Networks,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-khushboo-sachdeva-finmechanics",
    "content": "\nKhushboo Sachdeva, studying in IIT Kanpur as a BT  student in BSBE will be joining Finmechanics as Associate Consultant. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nBain - Associate ConsultantFlipkart - Associate Product ManagerCapital One - Business AnalystPartners Group - Venture CapitalistDa Vinci - Quantitative TradingA&M - ConsultantArthur D. Little - ConsultantAmerican Express - AnalystSprinklr - Product AnalystTata 1mg - Associate Product ManagerAccenture Solutions & Accenture Global - ConsultantPraxis - ConsultantInduss Insights - Associate\n\n## Insights on the Selection Process\nIt was quite wholesome, I was tested on three angles : Maths, Finance & Coding. There were2 rounds of interviews. First one was purely technical, 2 people in panel - One was thefounder and other was Associate Consultant. I was asked a Brainstellar puzzle, somequestions on python (my preferred language) and finance questions related to projects on myresume which mainly included Accounting & options. Besides that, they also asked aboutwhat the company does and surprisingly no candidate was able to answer this question fully. Iattended the pre placement talk and hence was able to answer, the interviewers were quitehappy (minor thing but got bonus points). Second round was more of an HR round where mypanel consisted of 8 people expecting you to get intimidated. They mainly talked about somequestions based on my resume, making situations out of it. Also, I was questioned about myadaptability if I had to code since I was more interested in Finance & Consulting. They alsomake you fill an HR form with the test, on which you can be questioned in the interview.\n\n##  Preparation Resources\nCase interviews Cracked + IIM Lucknow casebook for Consulting casesBrainstellar for puzzlesInvestopedia & Institute Economics courses material for FinanceAaditya Agarwal Video Series for CasesPreparing for Product Interviews Book for PM cases and some video series resourcesprovided by Flipkart\n\n## Advice for students (dos and don’ts)? \nTry not to panic in any situation - it's 70-80% about how confident you are and the wayyou conduct yourself, rest depends on your technical soundness.● You can never prepare with 100% resources, just select what you find useful andcomplete that resource. Stick to limited resources and do them honestly.● Being a non-coder, it doesn't harm revisiting the basics and practicing problems beforeplacements, it helped me a lot. Do not completely ignore coding, it will always help!● Try to apply to maximum companies that come, interview experiences are valuableand will make you ready for the D-Day.\n\n",
    "meta": {
      "title": "Khushboo Sachdeva: Placed at Finmechanics",
      "description": "Khushboo Sachdeva: Finmechanics(Associate Consultant)",
      "date": "2023-09-14",
      "tags": "Associate Consultant,Finmechanics,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-kratik-agrawal-jp-morgan-chase-amp-co",
    "content": "\nKRATIK AGRAWAL, studying in IIT Kanpur as a BS  student in MTH  will be joining JP Morgan Chase &amp; Co. as SDE . Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n InMobi – SDE Infurnia – SDE Dealshare – SDE DevRev – SDE SkanAI – SDE Tibra – Quant Trader Developer\n\n## Insights on the Selection Process\nThe interview process consisted of 3 Rounds, with 2 Technical Interviews and 1 HR Interview:All of the interview rounds began with exchanging introductions.Technical Interviews:1. First Round: 1 st round was based on solving DSA problems. The interviewer asked forfavorite data structures. Then the interviewer focused on the responded datastructures and grilled on them going from easy question to medium questions.2. Second Round: This round was based on System Design concepts and OOPS. Theinterview revolved around devising a system design for a Vending Machine.HR Interview:This interview revolved around standard HR questions. It was more of a structuredconversation and culture fitment round.Each of the rounds lasted for 30 minutes for me. Also, some people had an additionalTechnical Interview round between First and Second rounds, which was based on solving CPtype coding problems.\n\n##  Preparation Resources\nFollowing preparation resources can come in handy for SDE profile: DSA and problem solving from Leetcode, InterviewBit, Codeforces, etc. Striver’s A-Z &amp; SDE Sheet: https://takeuforward.org/This is handy if you’re a bit clueless about your preparation and need some structuresapproach for preparing yourself. Puzzles from Brainstellar (https://brainstellar.com/) “Fifty Challenging Problems in Probability” by Frederick Mosteller. “Cracking the Coding Interview” by G.L. McDowell. – Fantastic resource getting aholistic view of coding interview scenarios. “A Practical Guide To Quantitative Finance Interviews” by Xinfeng Zhou. – Greatresource if you’re targeting Quant profile &amp; HFTs.\n\n## Advice for students (dos and don’ts)? \n Have a Peer group: The placement season tends to be overwhelming at times. Besure to talk to your peer group. It helps to discuss things during preparation and aftertests. Also, a close friend acts as a wonderful support system. Have a go-to senior: Placement season imposes a lot of confusions, like, whichprofiles to target, which companies to apply for, whether to accept or reject your PPOoffer, etc. Besides all of this, you need someone to cheer you up and give valuable lastminute advices when you’re hours away from your interview. Understand &amp; Accept your chances: Be sure to realise your potential and not shy offfrom applying to job opportunities. Also, it is always recommended to have a fewbackup options, which you’re confident to crack incase you run out of luck. Build a Self-Story: For getting through culture fitment and HR questions, you just don’tneed a good resume, but a great binding agent to your resume. Have anunderstanding of how your resume reflects your story and mold it appropriatelyaccording to the role and company. Know your recruiter: Thoroughly read the Job Description provided by the company.Read the ‘About Us’ page of the firm. Have a thorough understanding of what are thevalues that your potential employer considers worthy. Fins ways to sneak in these bitsof information in your conversation with the interviewers to reflect your interest in thecompany and profile. Target Wisely: Discuss the profiles and companies that you’re targeting with yourseniors and get a fair understanding of how the firm typically recruits and what do theylook for in the resume, tests and interviews. Hear your Interviewer: Hear what the interview speaks of themselves in the interview.This helps greatly in asking out questions at the end of the interview and also whileformulating your answers during the interview.\n\n",
    "meta": {
      "title": "KRATIK AGRAWAL: Placed at JP Morgan Chase &amp; Co.",
      "description": "KRATIK AGRAWAL: JP Morgan Chase &amp; Co.(SDE )",
      "date": "2023-09-14",
      "tags": "SDE ,JP Morgan Chase &amp; Co.,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-kratika-agarwal-housingcom",
    "content": "\nKratika Agarwal, studying in IIT Kanpur as a BT  student in MSE  will be joining Housing.com as Associate growth. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nGroww(APM)Navi(APM)Media.net(Product analyst)Arzoo(APM)Zenon(Business analyst)Barclays(Data science)Tata 1mg(APM)Indus insightsJodo(Product analyst)\n\n## Insights on the Selection Process\nFirst round was product centric. I was asked about my favourite product and then theinterviewer started grilling upon that same product by asking questions like what new featurecan you think which can be added to this product and started asking some technical questionsregarding the same .Also some philosophical kind of about your journey and how you takeyour life as were asked. First round was common to all the profiles. Second round was thegrowth round where I was asked questions about my growth intern and then the interviewerstarted asking some situation based questions where he was giving me different scenariosand I had to provide the solution for the same. Then the third and the last round was HRround.\n\n##  Preparation Resources\n Preparing for product interviews Cracking the pm interviews Decode and conquer Pm school exercises playlist Pm exercises (for pm cases) Prepleaf (aptitude) Gfg(puzzles)\n\n## Advice for students (dos and don’ts)? \nMain thing for PM, consulting or any managerial role is case preparation.While preparing forcases (product or consulting) never just read the solution of the case.Try to set up the interview environment and ask your friend to give you a case . Set thetimer(initially it’ll be hard to complete it on time) and try to solve that within the set time. Afteryou are done with your case , read the solution and write the things which you missed outwhich could have made your solution better. And also you should first focus on the structureby which you’ll be solving the case that will help you in not diverting from the problem andyou’ll reach the solution easily.\n\n",
    "meta": {
      "title": "Kratika Agarwal: Placed at Housing.com",
      "description": "Kratika Agarwal: Housing.com(Associate growth)",
      "date": "2023-09-14",
      "tags": "Associate growth,Housing.com,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-lakshay-middha-rakuten-mobile",
    "content": "\nLakshay Middha, studying in IIT Kanpur as a BT-MT student in CE will be joining Rakuten Mobile as SDE . Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nFin mechanicsAmerican expressDirect AI (SDE)\n\n## Insights on the Selection Process\nQuestions were based on my resume.ML projects, implementations in new generation.Basic Coding questions.\n\n##  Preparation Resources\nInterview bit, leetcode, GFG etc\n\n## Advice for students (dos and don’ts)? \n1. Start your placement preparation as early as you can.2. Keep your academics load as minimum as possible because placement season is veryhectic with lots of tests to write and lots of forms to fill.\n\n",
    "meta": {
      "title": "Lakshay Middha: Placed at Rakuten Mobile",
      "description": "Lakshay Middha: Rakuten Mobile(SDE )",
      "date": "2023-09-14",
      "tags": "SDE ,Rakuten Mobile,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-lakshay-rastogi-bain-and-company",
    "content": "\nLakshay Rastogi, studying in IIT Kanpur as a BT (DM) student in CSE & BSBE will be joining Bain and Company as Associate Consultant. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nGlean – SoftwareMckinsey – Bussiness Analyst\n\n## Insights on the Selection Process\nConsulting interview process revolves a lot around how well you are able to solve a case.Don;t need to solve it explicitly, rather the process is what matters. Along with thiscommunication is absolute key. If you are not able to explain your thinking to the interviewerright now, or answer his/her question properly, how will you do this in front of a client.\n\n##  Preparation Resources\nFor case interviews, I used Case Interviews Cracked, SRCC Case Compedium and IIMACaseBook. Majorly 4 types of cases you need to practise well. Guesstimates are equallyimportant.Make good answers for the questions usually asked.\n\n## Advice for students (dos and don’ts)? \nFirst and foremost : Decide what role you would want to explore for the next 2-3 years of yourlife. Don’t thing about this decision as life changing. You are just 22. Even if you go forsomething you feel you like right now, but don’t actually later, there will be inumerableopportunities to move into something you find more intereting.Currently I feel consulting will be a very nice learning curve for me, but I am not taking it as aline of truth, that I am going to build my entire 30 year career out of this. Once you work atyour recent job, you will realize what work you would like more.Second : Don’t ever get anxious by how sorted somebody else looks. Primarily for tworeasons : If they are genuinely then it’s great, but you aren’t and that’s completely fine;Second, most aren’t they just present themselves as such to not showcase confusion.Later Do’s : Start early. Don’t try to fool yourself. Prepare honestly. It will take a lot of time,good feedback, hardwork, focus to get better at things. Don’t look at people who are alreadygood at the things you are trying to get good at. They have put in a lot of effort which you justcan’t see.Do’s : Always make a group to prepare and keep motivating each other. Preparing alone isvery difficult, although not impossible.Do’s : Never ever hesitate to reach out for help.Dont’s : Think of anything : “Ki ho jayega”. You don’t what you’re taking so lightly right now,will be so crucial in landing your preferred job.Dont’s : Let go of your academics for preparing. It will just add to the pressure. It also acts asa different area for you to focus on, and can help in breaking the monotony.\n\n",
    "meta": {
      "title": "Lakshay Rastogi: Placed at Bain and Company",
      "description": "Lakshay Rastogi: Bain and Company(Associate Consultant)",
      "date": "2023-09-14",
      "tags": "Associate Consultant,Bain and Company,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-m-shiva-teja-reddy-airbus",
    "content": "\nM Shiva Teja Reddy, studying in IIT Kanpur as a MT  student in AE  will be joining Airbus  as Associate Flight Controls and Hydraulics Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nNONE\n\n## Insights on the Selection Process\nTechnical Interview: Questions based on the projects that you have done. Course projects,Btech projects, Mtech thesis.HR interview: To test your communication and presence of mind.\n\n##  Preparation Resources\nYoutube, Google, Father.\n\n## Advice for students (dos and don’ts)? \nDos: Always ask time for any question that you are asked in case you need it. Ask for aminute and think about what you want to say.Use hand gestures. The interviewers sometimes try to set a friendly atmosphere so play alongit helps ease your nerves.Dont’s: If you want to get selected in that company then don’t tell them about your otherpreferences that you are attending interviews for. They may ask if you are trying for othercompanies. Say yes but that the one you are attending right now is your highest priority. Evenif it’s a lie.\n\n",
    "meta": {
      "title": "M Shiva Teja Reddy: Placed at Airbus ",
      "description": "M Shiva Teja Reddy: Airbus (Associate Flight Controls and Hydraulics Engineer)",
      "date": "2023-09-14",
      "tags": "Associate Flight Controls and Hydraulics Engineer,Airbus ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-madyahnam-parashu-ramudu-eaton",
    "content": "\nMadyahnam Parashu Ramudu , studying in IIT Kanpur as a MT   student in EE will be joining EATON as Eaton Technical Leadership program. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1. Texas instruments (Analog)2. TSMC (Physical Design)3. Intel (Digital)4. Qualcomm (Digital)5. Eaton (1.ETLP &amp; 2.Engineer Profile)6. ST Micro Electronics (Analog)7. Samsung (Digital)8. Bajaj (Electrical)9. Open five\n\n## Insights on the Selection Process\n1. Technical Test (Technical + Aptitude + English)2. Technical Interview (Crucial round)3. HR Interview\n\n##  Preparation Resources\nI have created drive link attached below. It contains previous year question papers of VLSIand Power engineering companies.Place_22\n\n## Advice for students (dos and don’ts)? \nAll the best….\n\n",
    "meta": {
      "title": "Madyahnam Parashu Ramudu : Placed at EATON",
      "description": "Madyahnam Parashu Ramudu : EATON(Eaton Technical Leadership program)",
      "date": "2023-09-14",
      "tags": "Eaton Technical Leadership program,EATON,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-mandar-bapat-google",
    "content": "\nMandar Bapat, studying in IIT Kanpur as a BT student in CSE  will be joining Google as SDE . Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nGraviton (Systems)Cohesity(SDE)\n\n## Insights on the Selection Process\nThe interview had three rounds: -Round 1:- This round consisted of some medium-level sorting questions from leetcode withdiscussion on resume projects and internships experiences and learningsRound 2:- This round was much more focused on coding with Dynamic programmingquestionsRound 3:- This Round consisted of a Hard problem of Multi source BFS and then somegeneral Hr based questions.\n\n##  Preparation Resources\nThe ‘Cracking the coding interview’ book consists of a lot of problems asked in FAANG aswell as general interview-related tips as the author herself has worked in many of thesecompanies.Standard:-Leetcode questionsInterview Bit questionsCSES problem set\n\n## Advice for students (dos and don’ts)? \nMaintain a regular practice schedule for coding tasks because it will come in handy duringinterviews. Practice frequently asked interview questions in particular.In addition to typical IDEs, try using Notepad to create your code because you often forgetdetails like indentations and syntax due to autocomplete ness of IDEs.Think carefully and courteously before you speak.Rather than giving an interview, feel more like having a friendly discussion with theinterviewer.\n\n",
    "meta": {
      "title": "Mandar Bapat: Placed at Google",
      "description": "Mandar Bapat: Google(SDE )",
      "date": "2023-09-14",
      "tags": "SDE ,Google,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-maryam-khan-business-analyst",
    "content": "\nMaryam Khan, studying in IIT Kanpur as a BT student in ME  will be joining Business Analyst as Business Analyst. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nPPO Unilever (Unilever Future Leaders Program: Supply Chain manager)Microsoft (SDE)J.P. Morgan (Analyst)Morgan Stanley (Analyst)N K Securities (Business Operations)BCG (Associate)Sprinklr (Business Analyst)Bain and Company (Associate Consultant)\n\n## Insights on the Selection Process\n-General calls from the company after shortlisting.-Panelists were Seniors/Partners of the company.-HR questions like COVID pandemic experience, accomplishments in college, gaps onresume, poor performance if any etc.-Questions were majorly based on resume.-Guesstimates and case study on topics related to resume, in my case, but from generaloverview, it varied.\n\n##  Preparation Resources\nIIT Bombay Case bookIITB Videos on youtubeSRCC Case bookIIT Ahmedabad Framework of cases.Note: Exchanging cases with peers, practicing with seniors and buddy etc was of great help.\n\n## Advice for students (dos and don’ts)? \nDos:-Start building your profile and peaks early; genuine over-the-years development >> last-minute self projects-Familiarize yourself with frameworks of different types of cases; Practice on a shuffled basis.-As you practice cases, customize the frameworks to add your mistakes/missing perspectives.-Process and logic are more important than your final answers in guesstimates. Soconcentrate on your logic more than the answers.-Resume headers are important. Quantification is imperative. How you label yourachievements and projects is vital.-Believe in yourself. Introduce yourself as if you have undergone a very exciting and insightfuljourney, and its your chance to present yourself.Don’ts:-Don’t focus on extremely diverse profiles. Being selective from the start saves time and effort.-Don’t write over-exaggerated stuff on your resume; Write only the points you can defend.(Moderate resume + good defense >> Good resume + Poor defense)-Don’t use repetitive and filler words during interviews. Take time to think MECE structurewhile cases. Taking time >> Irrelevant facts-Don’t overtire yourself in the last few days, solving cases require a fresh mind.\n\n",
    "meta": {
      "title": "Maryam Khan: Placed at Business Analyst",
      "description": "Maryam Khan: Business Analyst(Business Analyst)",
      "date": "2023-09-14",
      "tags": "Business Analyst,Business Analyst,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-mukund-soni-fourthfrontier-technologies",
    "content": "\nMukund Soni , studying in IIT Kanpur as a BT-ME  student in MSE  will be joining Fourth-Frontier Technologies as Full-stack developer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nJPMCBarclaysApollo24x7Urban HealthShipsyJavis\n\n## Insights on the Selection Process\nThe interview was directly an HR round, because the resume shortlist was highly based ontechnical skills, key projects and experiences based on the profile we applied (in my case Full-stack developer). Then the technical test was also based on Full-stack development, itconsists of two question on backend (we had to write some code to receive some data fromtheir database, and the other I don’t remember), two questions on frontend (we had todevelop a phonebook, and a button which toggles on click), and one coding question (codingquestion level was Leetcode easy).The interview round was mainly to check our communication skills, how we are thinking at themoment, and our confidence. It lasted around 30-40 minutes.\n\n##  Preparation Resources\nFor coding, first I read the topics from gfg and practice some basic questions on the topic fromthere (Basic and Intermediate). Then I solved the Interview bit for further practice, as it coversquestions asked in interviews. And finally, I solved problems on Leetcode for more practice onsome difficult questions for technical test.For preparations of HR round, we can find some standard questions on gfg and also theiranswers. But according to me we should not give the same answers as found from sources, itshould be purely based on our thoughts, we can just use the resources to know whatquestions are being asked.\n\n## Advice for students (dos and don’ts)? \nFor preparing the technical test, it is of utmost importance that we give coding contestsregularly. We can find weekly and bi-weekly contests on Leetcode, interviewbit, codechef andcodeforces. But majority of the tests in placements, which I gave, were based on the patternof leetcode coding contest, so we should not miss them, and should solve them regularly onfirst priority.\n\n",
    "meta": {
      "title": "Mukund Soni : Placed at Fourth-Frontier Technologies",
      "description": "Mukund Soni : Fourth-Frontier Technologies(Full-stack developer)",
      "date": "2023-09-14",
      "tags": "Full-stack developer,Fourth-Frontier Technologies,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-munish-gupta-da-vinci-derivatives",
    "content": "\nMunish Gupta , studying in IIT Kanpur as a BT  student in MTH  will be joining Da Vinci Derivatives. as Quantitative Researcher. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nWorldquant(Quant Researcher), Quantbox (QuantResearcher and Developer), Squarepoint(Developer), JPMC(Software), Kivi Capital(Quant),Morgan Stanley(Quant) on Day 1.\n\n## Insights on the Selection Process\nA representative from HR and from the technical team was present on the virtual call (Zoom).Once they give you a technical question, you are given 30 seconds to a minute to come upwith the solution or your approach. They ask you to think aloud to get to know the thoughtprocess. The Interview also involved standard HR questions, Why quant, why Da Vinci, etc.Another HR question was to describe a project that inspired you the most and the conditionsyou overcame. There was only one round and lasted around 45 mins.\n\n##  Preparation Resources\nFor Quants - 50 Challenging problems in Probability, Cut the knot: Probability Riddles,brainstellar.com, A Practical Guide to Quantitative Finance Interviews by Xinfeng Zhou andMSO201 slides.For Coding - leetcode, InterviewBit and CodingNinjas. Try to cover the breadth first.\n\n## Advice for students (dos and don’ts)? \nPlacement shortlists do involve a bit of luck, so don’t be disheartened if you are not initiallyshortlisted. Try to do previous year or company-specific questions as they are sometimesrepeated. In hindsight, I’d suggest starting the prep as early as possible. Even if you aretargeting other profiles, try to do a bit of coding. Lastly, a good group while preparing willdefinitely help.\n\n",
    "meta": {
      "title": "Munish Gupta : Placed at Da Vinci Derivatives.",
      "description": "Munish Gupta : Da Vinci Derivatives.(Quantitative Researcher)",
      "date": "2023-09-14",
      "tags": "Quantitative Researcher,Da Vinci Derivatives.,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-muskan-kivi-securities",
    "content": "\nMuskan, studying in IIT Kanpur as a BT student in EE will be joining Kivi Securities as Software Developer. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nWorld Quant, Quantitative researcherWinzo Games, Software developer and Data ScientistZomato, Software DeveloperOracle Software DeveloperSAP Labs, Software DeveloperMicrosoft, Software developer\n\n## Insights on the Selection Process\nand DP.Third Round- Puzzles and concepts of probability and statistics. Projects from resumes werealso discussed.Fourth Round- HR round.\n\n##  Preparation Resources\nFor the Coding partI did leetcode and interviewbit.- Some standard data structures and algorithms are like the vocabulary of English. Youhave to know some of them to be able to write code. So start with some standardalgorithms. You can refer to some youtube channels like codencode for graphs, adityaverma for DP, and recursion.- Don’t worry if you are not able to solve everything by yourself from the start. Try toidentify the patterns. For this, a very good resource is leetcode studyplans(https://leetcode.com/study-plan/). Questions are grouped according to thesimilarity of concepts. Even if some of the study plans are paid, you can look for thequestions on GitHub.- Give regular contests on any of the coding sites. I used leetcode for this. This will helpyou to apply what you have learned and will improve your speed too.For puzzles and probability part:- Revise MSO201 or any other probability course from your department.- Do puzzles from the book Practical Guide to Quantitative Finance Interviews ByXinfeng Zhou. You can easily find the pdf.- Brainstellar puzzles.- 50 challenging problems in probability\n\n## Advice for students (dos and don’ts)? \nStart early and try to solve some questions every day. There is a daily question featureon leetcode and gfg.- Mark the questions and concepts on which you struggled. I made an Excel sheet forthis. Revise them after some days or before a test/interview.- Shortlist 2-3 profiles and prepare for them only. Don’t run after every company andprofile.- Make a small group of people to prepare with. Preparing in a group is always better asyou can discuss doubts. Healthy competition always encourages you to performbetter.- Don’t hesitate to contact seniors. It does not matter whether you know that senior ornot. Just text them with your doubts. You can contact me also.\n\n",
    "meta": {
      "title": "Muskan: Placed at Kivi Securities",
      "description": "Muskan: Kivi Securities(Software Developer)",
      "date": "2023-09-14",
      "tags": "Software Developer,Kivi Securities,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-n-bhuvan-jaguar-land-rover-india-limited",
    "content": "\nN Bhuvan, studying in IIT Kanpur as a BT  student in EE will be joining Jaguar Land rover India Limited, as Electric Vehicle- Powertrain (Software) Graduate. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nNvidia {core}, Rakuten {software}, Oracle {software}, SAP labs {software}, Enphase {software}\n\n## Insights on the Selection Process\n45 min- 1 hr Interview, only one single round. Every kind of questions were asked by variouspeople.SOFTWARE- Linked lists, arrays and data management. Also made to solve a recursionbased questions.HARDWARE {Core}- Questions were pretty much based on the courses ESC201, EE210 andEE370. Questions from topics like analog-digital electronics, mosfet etc. were asked.\n\n##  Preparation Resources\nLecture Slides of all core courses. Leetcode and Codeforces for coding problems\n\n## Advice for students (dos and don’ts)? \nStart Early in the Summers itself. Alongside the intern, give 2-3 hrs daily to revision ofsubjects. Prepare your resume thoroughly. From start of the semester till mid-sems, practicetargetted questions, after that the test series will start.\n\n",
    "meta": {
      "title": "N Bhuvan: Placed at Jaguar Land rover India Limited,",
      "description": "N Bhuvan: Jaguar Land rover India Limited,(Electric Vehicle- Powertrain (Software) Graduate)",
      "date": "2023-09-14",
      "tags": "Electric Vehicle- Powertrain (Software) Graduate,Jaguar Land rover India Limited,,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-namratesh-shukla-capital-one",
    "content": "\nNamratesh Shukla, studying in IIT Kanpur as a BT student in AE  will be joining Capital one as Business Analyst role. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1. Groww – APM2. AnM3. Fin mechanics4. Accenture japan- business consultant5. Sprinkler- product analyst6. Associate trinity life sciences7. Indus Insights- Senior associate\n\n## Insights on the Selection Process\nCases involved lot of numbers and figures , so there was need of fast and accuratecalculations. Giving Correct answers was important even if you were slight late.A link was given to refer where sample cases were provided. The dataset of cases of thiscompany was vast.Initially qualitative questions were asked, then the case became quantitative towards the end.\n\n##  Preparation Resources\nnan\n\n## Advice for students (dos and don’ts)? \nnan\n\n",
    "meta": {
      "title": "Namratesh Shukla: Placed at Capital one",
      "description": "Namratesh Shukla: Capital one(Business Analyst role)",
      "date": "2023-09-14",
      "tags": "Business Analyst role,Capital one,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-nandita-gupta-alvarez-and-marsal",
    "content": "\nNandita Gupta, studying in IIT Kanpur as a BT( DM) student in MSE & ECO will be joining Alvarez and Marsal  as Associate. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n1. Bain2. Bcg3. Amex4. Accenture5. Barclays6. Capital One\n\n## Insights on the Selection Process\n1. First round - introductory and case study round - standard cases asked previously(usually unconventional case)2. Second round - case study round - Quantitative market entry case and guesstimate3. Third round - exchange of words and interaction with managing director (5-10 mins)informal round\n\n##  Preparation Resources\nCase interviews cracked (IITB case book)Youtube playlist - Aditya Agarwal IIMA\n\n## Advice for students (dos and don’ts)? \n1. Stay calm during the interview process2. Be interactive with the interviewer3. Do not hesitate to ask questions\n\n",
    "meta": {
      "title": "Nandita Gupta: Placed at Alvarez and Marsal ",
      "description": "Nandita Gupta: Alvarez and Marsal (Associate)",
      "date": "2023-09-14",
      "tags": "Associate,Alvarez and Marsal ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-nandni-sinha-alvarez-and-marsal",
    "content": "\nNandni Sinha, studying in IIT Kanpur as a BT student in MSE  will be joining Alvarez and Marsal  as Associate. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\n1) Indus Insights and Analytics2) Trinity Life Sciences3) Prasis Global AllianceProfiles: Associate/Analyst\n\n## Insights on the Selection Process\n1)Resume shortlist2) Interview (3 Rounds - intro and puzzle/case study type, resume grilling round andguesstimate, HR round)\n\n##  Preparation Resources\nPlacement Guide: https://drive.google.com/file/d/1Xlie8LxDi7-lstxi8BcnpMz-Bch6y9z6/viewPreparation document:https://docs.google.com/document/d/1KY-QhvHzwQrRhoOx5r4Nvh9Y9sWQlc5eOo9p52-G3pk/edit#Case Prep:https://drive.google.com/drive/folders/0B2qQx5DAQoeINUF4cmgwbEk5RXM?resourcekey=0-IcVEnTmMJnLGd7VcWxFydwhttps://drive.google.com/drive/folders/19TkbN7Ni7p-U3CnzGOCQX3nJV1TZbKauPuzzles: https://www.geeksforgeeks.org/puzzles/#Puzzles50 Challenging Problems:https://mbapreponline.files.wordpress.com/2013/07/fifty_challenging_problems_in__2.pdfCase In point: https://www.wallstreetoasis.com/files/case-in-point-7th-edition1.pdfBrainstellar: https://brainstellar.com/IIMA CasebookDD Learning:https://docs.google.com/document/d/10SHCT-RP-4F3oVJsYKonpymUhRV3ObiBZd690U3Mslo/editInterview Guide:https://www.robertwalters.co.nz/content/dam/robert-walters/global/files/complete-interview-guide/Interview-guide-web.pdfConsulting Interview Prep: https://mconsultingprep.com/consulting-interview-questions/Interview prep:https://docs.google.com/document/d/1sGxSMZOR4CM-g-GbKiwU-K-2fzkGShgS/editSee Victor Cheng's videos on interview preparation as well\n\n## Advice for students (dos and don’ts)? \nDon't prepare just for consulting, have one or more profiles as a backup option.Practice as many case study/guesstimate questions as possible (with seniors and friends)Commonly asked Case Studies: Market entry, cost optimisation, and profitability.Start your preparation at least from July.Be smiling and confident in interviews and workshops as well, and be communicative.\n\n",
    "meta": {
      "title": "Nandni Sinha: Placed at Alvarez and Marsal ",
      "description": "Nandni Sinha: Alvarez and Marsal (Associate)",
      "date": "2023-09-14",
      "tags": "Associate,Alvarez and Marsal ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-nilay-beniwal-walmart",
    "content": "\nNilay Beniwal, studying in IIT Kanpur as a BS student in MTH  will be joining Walmart as SDE and data scientist. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nNK securitiesSprinklerSamsungNavi\n\n## Insights on the Selection Process\nScreening test + Resume ShortlistInterview (3 rounds)R1- TechnicalR2- Resume based questionsR3-HR round\n\n##  Preparation Resources\nStriver sheetSPO resources\n\n## Advice for students (dos and don’ts)? \nBe prepared before endsem , as you won’t get time to prepare after it.Confidence is a must thing , it’s the first thing they see. , intern\n\n",
    "meta": {
      "title": "Nilay Beniwal: Placed at Walmart",
      "description": "Nilay Beniwal: Walmart(SDE and data scientist)",
      "date": "2023-09-14",
      "tags": "SDE and data scientist,Walmart,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-nishima-panwar-capital-one",
    "content": "\nNishima Panwar, studying in IIT Kanpur as a BT student in CSE will be joining Capital One as Software Engineer . Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nSAP LABS - Software EngineerHead Digital - Software EngineerEnphase Energy - Software Engineer\n\n## Insights on the Selection Process\n1. Online test2. Offline test (just before interview process)3. Interview (2 rounds)\n\n##  Preparation Resources\n1. Interviewbit2. Leetcode3. CP Algorithm4. Codeforces\n\n## Advice for students (dos and don’ts)? \n1. Try to code everyday and start nearly 9-10 months ago.2. Concentrate more on topics like DP,graphs and trees.3. Try to keep CPI above 7.54. Keep your academic courses low in the 7th semester.5. Trust the process. Your time is coming\n\n",
    "meta": {
      "title": "Nishima Panwar: Placed at Capital One",
      "description": "Nishima Panwar: Capital One(Software Engineer )",
      "date": "2023-09-14",
      "tags": "Software Engineer ,Capital One,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-piyush-agarwal-sap-labs-and-developer-associate",
    "content": "\nPiyush Agarwal, studying in IIT Kanpur as a BT student in nan will be joining SAP Labs and Developer Associate- as Central Business Association. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSprinklr- PE , NK Securities – Quant, Software Developer, BusinessSquarePoint Capital – Infrastructure DeveloperNomura –Maverick, Capital One- Software, JPMC – SDE, Cohesity, Rakuten, Plutus Research –SoftwareAudify\n\n## Insights on the Selection Process\nHackerRank Test – Standard Questions with a little bit of Tricky partRound 1- Load Balancing for Distributed EnvironmentRound 2- Resume based intern project discussion and Course Project DiscussionRound 3- General HR Round and explanation about profile and general discussion with HR\n\n##  Preparation Resources\n50 Challenging Problems in ProbabilityLeetcodePCLub Archive, SPO Test Series\n\n## Advice for students (dos and don’ts)? \nFill your priority after thinking where you have high probability of securing a job rather thancompanies with high Brand Value.Prepare your Resume after preparing thoroughly and in a detailed manner and knoweverything what you have written in the resume.Start coding early preferably before or the onset of 6th semesterComplete Pclub Archive and SPO Test Series and prepare each and every question wellDuring Placement Test keep practicing questions at room.DP, Binary Search and Greedy are the most important paradigms for the placement test\n\n",
    "meta": {
      "title": "Piyush Agarwal: Placed at SAP Labs and Developer Associate-",
      "description": "Piyush Agarwal: SAP Labs and Developer Associate-(Central Business Association)",
      "date": "2023-09-14",
      "tags": "Central Business Association,SAP Labs and Developer Associate-,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-piyush-tiwari-captial-one",
    "content": "\nPiyush Tiwari , studying in IIT Kanpur as a nan student in nan will be joining Captial one as Business Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1. Gain credit2. Appollo 24/7- Business Analyst3. Indus insights- Associates4. Tata 1mg-APM5. Paytm- SE\n\n## Insights on the Selection Process\nStarted with Resume shortlist , no cpi criteria, no branch criteria, only Aptitude test (40questions in 1 hour). Shortlist on basis of Test , many students were shortlisted.\n\n##  Preparation Resources\nCapital one case studies YouTube channelArihant quantitative aptitude bookBrainstellet probability quizzesGeeksforfeeks puzzles50 problems in Probability bookGuesstimates from an IIM Ahmedabad booklet\n\n## Advice for students (dos and don’ts)? \nDo’s-1.Start your preparation just after summers.2. Ask for other colleges (NITs and other) for interview questions as there interviews are helpbefore.3. Be in a good and secure support system who keeps you motivated all the time. Your studygroup should be dynamic and enlightening.Don’ts-1. Never loose the consistency.2. Don’t leave your preparation for last moment as We have endsems in Nov end andinterviews are just after that.3. Don’t make your 7 th sem too much heavy.4. In interviews, keep your personality and Don’t say fake things to flatter the intervieweras you may get trapped.5. If company asks how many other companies have shortlisted you , tell them the truthonly especially of the same slot.\n\n",
    "meta": {
      "title": "Piyush Tiwari : Placed at Captial one",
      "description": "Piyush Tiwari : Captial one(Business Analyst)",
      "date": "2023-09-14",
      "tags": "Business Analyst,Captial one,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-pradeep-kumar-choudhary-kbr",
    "content": "\npradeep kumar choudhary, studying in IIT Kanpur as a MT student in CHE will be joining KBR as Associate Technical Professional - Process. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nHSBC – AnalystDeloitte – Analyst\n\n## Insights on the Selection Process\n1) Resume Shortlist2) Written MCQ test (Offline)3) Interview\n\n##  Preparation Resources\nKBR official website.2. Hand written notes of Btech Summer Intern.3. Gate notes for subjects like – Heat Transfer, Mass transfer, Fluid Mechanics and CRE.\n\n## Advice for students (dos and don’ts)? \nThere were similar questions like GATE exam in the written exam with core subjects only (HTMT CRE FM MO). Prepare those credentials well that you have mentioned in your resumeand that matches company’s job profile requirements. Prepare core subjects well in advance, basic concepts, design of equipment if there is any. Be calm during the interview process,take your time to think about the technical questions. If you are not sure about your answer,politely accept that and dont make irrelevant stories.Best of Luck!\n\n",
    "meta": {
      "title": "pradeep kumar choudhary: Placed at KBR",
      "description": "pradeep kumar choudhary: KBR(Associate Technical Professional - Process)",
      "date": "2023-09-14",
      "tags": "Associate Technical Professional - Process,KBR,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-prakarsh-agrawal-navi",
    "content": "\nPrakarsh Agrawal, studying in IIT Kanpur as a BT student in CE will be joining Navi as  Data Science. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nI was also shortlisted for the data science profile in sprinklr in the same slot as Navi. In SDEprofile, I was shortlisted in Edgeverve, Trellix. There were some more companies in which Iwas shortlisted for analyst profile.\n\n## Insights on the Selection Process\nnan\n\n##  Preparation Resources\nAt first, there was a technical test which included some aptitude and coding questions. Then,there was resume shortlisting which was followed by 2 rounds of technical interview.\n\n## Advice for students (dos and don’ts)? \nI used leetcode to practice coding. Also, I practiced interviewbit programming questions.For SQL, I used datalemur(https://datalemur.com/) basic version. It contains some very goodinterview questions. Practicing these questions for SQL would be enough I guess. Try to learnfrom the solution given. You can read the DBMS theory part from youtube or geeksforgeeksor resources section of interviewbit.For probability, I used brainstellar and 50 challenging problems book.For machine learning and related topics, I read from geeksforgeeks and towardsdatasciencearticles.Also, I found resources section of interviewbit very helpful. It contains topicwise notes andinterview questions.\n\n",
    "meta": {
      "title": "Prakarsh Agrawal: Placed at Navi",
      "description": "Prakarsh Agrawal: Navi( Data Science)",
      "date": "2023-09-14",
      "tags": "Data Science,Navi,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-prakhar-maheshwari-apple",
    "content": "\nPrakhar Maheshwari , studying in IIT Kanpur as a BT student in EE will be joining Apple as Software and Hardware integration. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSamsung Research, Bangalore SDECapitalOne SDEApple SDEDealShare SDESprinklr Product EngineerNK Securities Research Quantitative ResearcherNK Securities Research Software developer\n\n## Insights on the Selection Process\nQuestions from branch courses such as EE320, EE210, coding questions about fundamentalsof C such as pointers, arrays, and questions checking the aptitude.\n\n##  Preparation Resources\n Leet code, GFG Glass door Quant-50 challenging problem Practical guide to quantitative finance interviews Ee200 EE320 EE321 EE370 MSO201\n\n## Advice for students (dos and don’ts)? \nOne should choose this profile only if one is very interested or if they like core subjects(mainly electrical)During the interview they should keep interacting with the interviewee.Strengthen your C fundamentals\n\n",
    "meta": {
      "title": "Prakhar Maheshwari : Placed at Apple",
      "description": "Prakhar Maheshwari : Apple(Software and Hardware integration)",
      "date": "2023-09-14",
      "tags": "Software and Hardware integration,Apple,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-protyaydeep-shee-housingcom",
    "content": "\nProtyaydeep Shee, studying in IIT Kanpur as a BT student in MSE will be joining Housing.com as APM role. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSprinklr APMZupee Founders officeAmerican Express (Management Training)Arzoo PAHiLabs DS\n\n## Insights on the Selection Process\nPractice should be there, (Mock interviews)Deck practiceResume should be more similar to consulting and product type\n\n##  Preparation Resources\nPractice Questions: http://www.productmanagementexercises.comInterview Experience: YouTube Channel – Exponent, Product SchoolBooks:1)Preparing for Product Interviews (Advaith Sridhar) – Problem solving, Deck Making 2)Decodeand Conquer (Lewis C. Lin) – Problem Solving3) Cracking the PM Interviews (Gayle Laakmann McDowell) - Interview4) Swipe to Unlock (Aditya Agashe, Parth Detroja, Neel Mehta) – Tech Understanding\n\n## Advice for students (dos and don’ts)? \nPractice more mock interviews, don’t take them lightly.Be calm don’t get overwhelmed.Many assignments and tests are going on simultaneously which may create a panic situation,you should stay calm, fix your priorities and work accordingly.Don’t isolate yourself in the preparation, your friends can be helpful in brainstorming andhandling the pressure so you can share anything that worries you.\n\n",
    "meta": {
      "title": "Protyaydeep Shee: Placed at Housing.com",
      "description": "Protyaydeep Shee: Housing.com(APM role)",
      "date": "2023-09-14",
      "tags": "APM role,Housing.com,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-rahul-hilabs",
    "content": "\nRahul, studying in IIT Kanpur as a BS student in ES will be joining Hilabs  as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nAvendus IBXenon SDEUrban Health SDECapital One BA\n\n## Insights on the Selection Process\nFirst round consisted of DSA puzzles, Second round also consisted of DSA puzzles and someimplementation questions, some general questions\n\n##  Preparation Resources\nGFG, LeetCode, InterviewBit, Youtube\n\n## Advice for students (dos and don’ts)? \nStart DSA timely (very important). Only DSA won”t help, you also should know development,CS Fundamentals etc.Be Profile-Specific.Go to every senior irrespective of CPI, skills etc. to know how to handle placements better\n\n",
    "meta": {
      "title": "Rahul: Placed at Hilabs ",
      "description": "Rahul: Hilabs (SDE)",
      "date": "2023-09-14",
      "tags": "SDE,Hilabs ,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-reuben-mendonsa-tata-advance-system-limited",
    "content": "\nReuben Mendonsa, studying in IIT Kanpur as a MT student in AE will be joining Tata Advance System Limited as Post Graduate Engineer Trainee. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1) Airbus, Profile: Flight Physics2) New Space, Profile: Structures\n\n## Insights on the Selection Process\nFirst, had to introduce myself. Then have to describe my thesis work. Then questioned had tobe answered regarding basic flight mechanics and stability.\n\n##  Preparation Resources\n1) Gate Syllabus through review2) Basic Aptitude prep from books and you tube\n\n## Advice for students (dos and don’ts)? \nDos1) Prepare your fundamentals properly. The Basics, i.e Thermodynamics, heat transferand Fluid Mechanics2) Practice aptitude slowly and regularly, just the basics.Donts1) Do not put things in your resume that you are not confident about.2) Do not stress out if you miss on the early companies, you will get opportunities later.\n\n",
    "meta": {
      "title": "Reuben Mendonsa: Placed at Tata Advance System Limited",
      "description": "Reuben Mendonsa: Tata Advance System Limited(Post Graduate Engineer Trainee)",
      "date": "2023-09-14",
      "tags": "Post Graduate Engineer Trainee,Tata Advance System Limited,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-rhythm-chouksey-pinelabs",
    "content": "\nRhythm Chouksey, studying in IIT Kanpur as a BT student in AE will be joining PineLabs as SDE. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nI was also shortlisted for Rakuten Group Japan, Axis Bank (Data Analyst) and SDE Amedus\n\n## Insights on the Selection Process\nThe interview experience was very good. It consisted of 3 rounds. First two were technicaland the third was HR. In the first round 2 coding in which we have to explain the algorithm andwrite the pseudo code. Questions from object oriented programing were also asked. Thesecond round was much detailed and had only one question the interviewer was itself an alumof IITK and also asked some questions related to logic behind the algorithm and then asked toreduce the time complexity of the code. Last round I was asked about what do I know aboutPine Labs. What does the company do. my internship experience and why I want to join pinelabs.\n\n##  Preparation Resources\nLeetcode blind 75Aditya verma for dynamic programingWatched videos of Neetcode and take u forwardSoved questions on gfg, leetcode and interview bitStudied object oriented programming from gfg resources\n\n## Advice for students (dos and don’ts)? \nTry to solve as much problems as possible do not leave any concepts and also make a habitof thinking in steps so that in the interview you can explain your thought process behind yourcode sometime the interviewer wants to understand the intuition behind you code and alsoexplain any other method if you know that the question can be solved with. Work on yourEnglish skills and do some research about the company which you are selected for beforegoing for the interview also try to make a goal of solving a fixed number of question each dayas you have to manage your acads with your placement preparations\n\n",
    "meta": {
      "title": "Rhythm Chouksey: Placed at PineLabs",
      "description": "Rhythm Chouksey: PineLabs(SDE)",
      "date": "2023-09-14",
      "tags": "SDE,PineLabs,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-rishik-jain-infurnia",
    "content": "\nRishik Jain, studying in IIT Kanpur as a Dual degree  student in CSE will be joining Infurnia as Software Development Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n• Sprinkler – PSE/PE• Cohesity• NK Securities - Software• Oracle• Squarepoint Capital• Qube\n\n## Insights on the Selection Process\n• 3 rounds of interviews• Lots of resume-based questions• Small team, the interviewers were the founder and team leads.• Lots of followup questions based on your answers• Discussion intensive interview\n\n##  Preparation Resources\n• None of the usual resources were needed for this interview.• Logic based questions and puzzles required some on-the-spot thinking.• System Design questions were easy, and discussion based.\n\n## Advice for students (dos and don’ts)? \n• For startups, keep asking a lot of questions around variations of the problems.• As the team is relatively small, the interviewers are usually CXOs. Ask them in detailabout the product, the market, the technologies, and methodologies involved.\n\n",
    "meta": {
      "title": "Rishik Jain: Placed at Infurnia",
      "description": "Rishik Jain: Infurnia(Software Development Engineer)",
      "date": "2023-09-14",
      "tags": "Software Development Engineer,Infurnia,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-rohit-kakkar-jio-platform",
    "content": "\nRohit Kakkar, studying in IIT Kanpur as a M.Des student in Design will be joining Jio Platform as UI/UX designer role. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nMake My TripWinzoHCL\n\n## Insights on the Selection Process\n1.) There were 2 rounds-1 Technical and 1 HR.2.) Technical round was all about general portfolio projects and 1 detailed question regardingany portfolio project that the interviewer may find interesting.3.) Whiteboard Challenge- just like PM role interviews were given a random case study andasked questions on that.\n\n##  Preparation Resources\n1) YouTube (Design Pilot, etc)2) Coursera\n\n## Advice for students (dos and don’ts)? \n1.) Try to diversify your portfolio. /Projects.2.) Try that you build your resume such that you have at least one project from all the majorsectors so that you can easily get shortlisted for the interviews3.) Be -prepared with the UI/UX part of any of the projects that you may think the interviewercan ask you. Most of your interview rounds will be based on that.4.) Stay calm during the interview and try to be a problem solver.\n\n",
    "meta": {
      "title": "Rohit Kakkar: Placed at Jio Platform",
      "description": "Rohit Kakkar: Jio Platform(UI/UX designer role)",
      "date": "2023-09-14",
      "tags": "UI/UX designer role,Jio Platform,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-s-sruthi-applied-materials",
    "content": "\nS Sruthi, studying in IIT Kanpur as a MT student in MSE will be joining Applied Materials as Application Engineer. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nWabtech\n\n## Insights on the Selection Process\nInterview: Basic conceptual questions were asked in first round. In Second and Third roundsmostly company based questions were asked.\n\n##  Preparation Resources\nCourses of IITKCallister’s Material Science Engineering (Book)Physical Metallurgy by Raghavan (Book)Electronic Devices and Characterization (Book)\n\n## Advice for students (dos and don’ts)? \nDos:1. Be clear on your M.Tech project2. Be thorough with Material Characterization Techniques3. Attend Pre- Placement Talks and answer your interview questions based on that.Don’ts:1. Don’t give vague answers. Be precise in your answers. Admit if you don’t know theanswers.2. Don’t bluff in your resume.\n\n",
    "meta": {
      "title": "S Sruthi: Placed at Applied Materials",
      "description": "S Sruthi: Applied Materials(Application Engineer)",
      "date": "2023-09-14",
      "tags": "Application Engineer,Applied Materials,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-saaransh-aggarwal-maverick-derivatives",
    "content": "\nSaaransh Aggarwal, studying in IIT Kanpur as a nan student in nan will be joining Maverick Derivatives as Quantitative Analyst. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nInfurnia, Atlassian, World Quant, Quadeye, Winzo, Square Point, Sprinklr, Apple, Plutus,Oracle, Zomato, Skan.AI, Walmart, Head Digital, Dealshare, Apollo\n\n## Insights on the Selection Process\nThe selection process was:First a test was conducted, some people were shortlisted then another test was conducted,then finally 4 rounds of interview were conducted\n\n##  Preparation Resources\n1. Brainstellar2. 50 CP3. Xinfeng Zhou4. GFG, InterviewBit for Puzzles5. Leetcode, InterviewBit, GFG for coding\n\n## Advice for students (dos and don’ts)? \n1. Start early and be consistent2. Code regularly3. Placement season is very hectic, always keep your calm and have faith in yourself\n\n",
    "meta": {
      "title": "Saaransh Aggarwal: Placed at Maverick Derivatives",
      "description": "Saaransh Aggarwal: Maverick Derivatives(Quantitative Analyst)",
      "date": "2023-09-14",
      "tags": "Quantitative Analyst,Maverick Derivatives,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-samarth-choudhary-signal-chip",
    "content": "\nSamarth Choudhary, studying in IIT Kanpur as a BT student in EE will be joining Signal Chip as Embedded software engineer.. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nTata 1mg (Product)Navi (Analytics)Gain credit (analytics)Optym (SDE)Edgeverve (SDE)Amadeus(SDE)Zenon(SDE)Jio platforms(SDE)\n\n## Insights on the Selection Process\nTechnical Test\n\n##  Preparation Resources\nBasics of cpp from Love Babbar (Youtube)DSA through Striver (youtube)OOPS and MySQL through Love Babbar (Youtube) .Interviewbit , GFG and Leetcode to practice DSA questions.Striver’s dsa sheet covers most of the concepts of DSA.GFG’s articles for clarifying the concepts.\n\n## Advice for students (dos and don’ts)? \n1. Start preparing as early as possible for the placements .2. Consistency is a key during placements. Time must be divided between differentaspects of preparation (resume- project revision , DSA , theoretical topics like oops ,dbms ,os , cpp concepts , also revising the other languages/skills written in theresume).3. write only the stuff in the resume of which you are sure and be thorough with each andevery point in the resume.\n\n",
    "meta": {
      "title": "Samarth Choudhary: Placed at Signal Chip",
      "description": "Samarth Choudhary: Signal Chip(Embedded software engineer.)",
      "date": "2023-09-14",
      "tags": "Embedded software engineer.,Signal Chip,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-sandeep-patwa-signal-chip",
    "content": "\nSandeep Patwa, studying in IIT Kanpur as a MT student in EE will be joining Signal Chip as Systems Hardware Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nIntelTexas InstrumentsQualcomm\n\n## Insights on the Selection Process\nTest\n\n##  Preparation Resources\n1. Communication Systems book by Simon Haykin2. Digital Signal Processing book by Oppenheim - Chapter 4 and 5 only3. Geeks for Geeks for programming questions4. Gate level aptitude questions\n\n## Advice for students (dos and don’ts)? \n1)Prepare your basics very well.2)Instead of tough questions first solve easier ones in written test since there will be timeconstraints.3)Keep practicing at least 10 questions daily for aptitude and C output questions. Forceyourself to do so even if you feel like skipping.4)Consistency is better than perfection.\n\n",
    "meta": {
      "title": "Sandeep Patwa: Placed at Signal Chip",
      "description": "Sandeep Patwa: Signal Chip(Systems Hardware Engineer)",
      "date": "2023-09-14",
      "tags": "Systems Hardware Engineer,Signal Chip,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-sandipan-mitra-auronova-consulting",
    "content": "\nSandipan Mitra, studying in IIT Kanpur as a BT student in CE will be joining Auronova Consulting as (Consulting). Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nFinmechanicsAlvarez and MarsalIndus InsightsJLRPine LabsEversana\n\n## Insights on the Selection Process\nThe shortlisting process was based on Cpi and test both. Test mainly consists of aptitude question and some probability statistics questions.\n\n##  Preparation Resources\n1. Brainstellar and Geeks for Geeks and Gurmeet’s Puzzles for puzzles.2. Leetcode for software3. IIM Ahmedabad case book and IIT Bombay case interview cracked for guestimates.4. Interviewbit for SQL5. W3schools for oops and SQL6. Previous year CAT papers for aptitude\n\n## Advice for students (dos and don’ts)? \n1. Prepare the resume very well. Don’t try to fake things in resume. You should knowabout everything you are writing in your resume be it any project or even the coursesyou are writing, if any.2. Read well about the company and the job description.3. Be confident with your answers and always try to answer the question.4. English speaking skills are very important if you are going for consulting profile.5. Talk to people already placed on day 1, if you are not placed on day 1 and talk toseniors who were placed in that company earlier.6. Practice in groups for consulting problems.7. Don’t be overconfident on the shortlists and always keep some options for later days inworst case.\n\n",
    "meta": {
      "title": "Sandipan Mitra: Placed at Auronova Consulting",
      "description": "Sandipan Mitra: Auronova Consulting((Consulting))",
      "date": "2023-09-14",
      "tags": "(Consulting),Auronova Consulting,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-saurabh-sahu-signal-chip",
    "content": "\nSaurabh Sahu, studying in IIT Kanpur as a MSR student in EE(MVLSI) will be joining Signal Chip as Design Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nIntel(Hardware)Texas Instruments(Analog)Samsung Bangalore(Hardware)Cisco(Hardware)Aura Semiconductors(Analog)Open Five(Analog)\n\n## Insights on the Selection Process\nTest\n\n##  Preparation Resources\nProf. Janakiraman’s Lectures (Digital IC design)Prof. Indranil Sen Gupta Lectures(Verilog, Physical Design)MIT Open courses( Computational Structure)Karthikey Vilappan (Youtube) CDCHDL Bits Verilog problemsDGQS- practice sheet( full syllabus)Champion T Passive Electric Circuits(Youtube for Analog)NPTEL- Prof. Nagendra Krishnapura (Basic electrical circuits, Analog IC design)Shubham Sahay Lectures(EE370 Lectures)\n\n## Advice for students (dos and don’ts)? \nDo’s:1. Be confident and keep talking and be interactive with the panelists.2. Don’t be less confident about your language.3. Approach to questions is more important than the answers.Don’ts:1.Don’t bluff on your resume.2.Don’t panic if one of your interviews went bad.\n\n",
    "meta": {
      "title": "Saurabh Sahu: Placed at Signal Chip",
      "description": "Saurabh Sahu: Signal Chip(Design Engineer)",
      "date": "2023-09-14",
      "tags": "Design Engineer,Signal Chip,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-shikhar-saroj-verma-flipkart",
    "content": "\nShikhar Saroj Verma, studying in IIT Kanpur as a BT-MS student in ECO will be joining Flipkart as AM (Business Development). Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nCapital One [Business Analyst], Nomura [Analyst], JPMC [Focused Analytics], AmericanExpress [Analyst], Barclays, Accenture Japan, Indus Insights\n\n## Insights on the Selection Process\n[1] There was resume shortlisting, not sure about the criteria. Probably a run-down of theresume.[2] No GD[3] One hour test covering basic Aptitude and simple puzzles. One section of some basiceconomics related questions was also there [supply-demand, game theory (ECO101 level)]\n\n##  Preparation Resources\nAPTITUDE &amp; PUZZLES: Brainstellar, GFG puzzles, TedEd puzzles, CAT papers,STATS AND ML: ‘StatQuest with Josh Starmer’ YouTube channel, MSO201 class notes, 50challenging problems in probability, CS771 class notesFINANCE: Investopedia, any standard textbook on financial engineering (JUST BASICS)\n\n## Advice for students (dos and don’ts)? \nPlease pick a few resources and stick to them. Do not worry about resource X beingmarginally better than resource Y. I wasted too much time worrying about what book/resourceto follow. It is all the same. Just make sure you run through whatever source you follow by thetime the interviews start. Holds true for all profiles.It is a great idea to be a part of a small group (~4) of people who are preparing for the sameprofile as you. Really helps in tracking progress. I did not do this and clearly suffered.Please enroll in some MCQ test series to get a taste of the actual setting. The questions aremostly easy but getting a lot of them right needs practice.Surround yourself with supportive people when the interviews start. Let them handle phonecalls and interview call-ups. You can and should focus on running through your resume-related answers and other such things.Don’t get scared about chatter like company X not coming for placements, company Y onlydoing binary hiring…none of it matters by the time placements start. There are more thanenough opportunities for you and your friends. Don’t become a part of the noise and calmyourself and your friends down. SPO works very hard to improve # of companies every year.They will take care of the companies coming in.\n\n",
    "meta": {
      "title": "Shikhar Saroj Verma: Placed at Flipkart",
      "description": "Shikhar Saroj Verma: Flipkart(AM (Business Development))",
      "date": "2023-09-14",
      "tags": "AM (Business Development),Flipkart,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-shreya-karmakar-data-science-analyst",
    "content": "\nShreya Karmakar, studying in IIT Kanpur as a MS student in Statistics will be joining Data Science Analyst as Accenture Applied Intelligence. Here are some brief insights of hers.\n\n## Shortlisted Profiles & Companies:\nAnalyst role in Axtria, Citibank, PwC, EXL and HSBC.\n\n## Insights on the Selection Process\n1. Resume Shortlisting2. Technical Interview- I3. Technical Interview- II\n\n##  Preparation Resources\nFor aptitude, Indiabix, facprep, javatpoint, gfg,For coding, gfg, hackerrank,Explored blogs, like analyticsvidyaTowards data science is also a site people can refer to.Preparing the projects that I mentioned in my resume.\n\n## Advice for students (dos and don’ts)? \nThere is no way to exactly follow someone, you can get learning material maybe, but youcan’t follow a certain roadmap, you have to prepare in your own way. You have to beconsistent is all.\n\n",
    "meta": {
      "title": "Shreya Karmakar: Placed at Data Science Analyst",
      "description": "Shreya Karmakar: Data Science Analyst(Accenture Applied Intelligence)",
      "date": "2023-09-14",
      "tags": "Accenture Applied Intelligence,Data Science Analyst,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-sridhar-bheemani-juniper-networks",
    "content": "\nSridhar Bheemani, studying in IIT Kanpur as a MT student in EE(SPCOM) will be joining Juniper Networks as ASIC Design Engineer 2. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nIntel for Digital Design Engineer, Cisco for ASIC Design Engineerprofile, Analog Devices for Digital Design Engineer role, TSMC for Physical Design role andAura for Analog Design Engineer profile\n\n## Insights on the Selection Process\nExcept TSMC every other company has a selection process based on written test. TSMC was\n\n##  Preparation Resources\nDigi.QS pdf2. Digital IC design lectures from IIT madras by Janakiraman.3. VLSI expert website for STA.4. Hardware modelling using Verilog from IIT KGP by Indranil Sen Gupta (Highlyrecommended).5. Digital Circuit design (Gate notes are very much enough).6. Memories (SRAM, DRAM V.IMP topic) from rabaey lectures.7. C programming - You just need to practice the MCQs from geeksforgeeks(GFG), butobviously it is better if know how to code also.8. FIFO depth, Synchronizers, Clock Domain Crossing, Computer Architecture (mainlyfor written tests V.IMP topic), Physical design flow and Puzzles from GFG.\n\n## Advice for students (dos and don’ts)? \nWhen it comes to written tests be prepared with Aptitude, C programming, Digi.QS pdf.Prepare consistently and it will be like mini preparation for the GATE exam. Be calm and showyour skills and honesty from your side. Try to answer each question that the interviewer asks,try to avoid saying don’t know, they will give you enough time to solve and explain the stepsthat you are following. They see your approach to the question, don’t mind about resultsometimes.\n\n",
    "meta": {
      "title": "Sridhar Bheemani: Placed at Juniper Networks",
      "description": "Sridhar Bheemani: Juniper Networks(ASIC Design Engineer 2)",
      "date": "2023-09-14",
      "tags": "ASIC Design Engineer 2,Juniper Networks,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-supratim-paul-tsmc",
    "content": "\nSupratim Paul, studying in IIT Kanpur as a MT student in EE(Control and Automation) will be joining TSMC as Chip Design Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nTexas InstrumentsEnphase EnergySTmicroelectronics\n\n## Insights on the Selection Process\nResume shortlist\n\n##  Preparation Resources\nNeil H. E. Weste, David Money Harris - CMOS VLSI DesignDigital Integrated Circuits- RabaeyIndranil Sengupta lectures on Physical DesignFor Analog- Razavi lectures on YouTubeJanakiraman Video lectures on YouTubeNotes from Qureshi sir’s lectures EE619M. Morris Mano. - Digital Logic and Computer Design\n\n## Advice for students (dos and don’ts)? \nDo not leave any part during your preparation. Even a small question unanswered in any topiccan make your impressions look bad. For case studies do not give up at any cost. Answer thequestion in the most logical way. If you can study both analog and digital and prepare for bothdomains as they go parallelly. That will increase the insight in both domains. Understandeverything physically as the answer with physical explanations are highly valued in theinterviews.\n\n",
    "meta": {
      "title": "Supratim Paul: Placed at TSMC",
      "description": "Supratim Paul: TSMC(Chip Design Engineer)",
      "date": "2023-09-14",
      "tags": "Chip Design Engineer,TSMC,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-tanikella-sai-kiran-intel",
    "content": "\nTanikella Sai Kiran, studying in IIT Kanpur as a MT student in CSE will be joining Intel as Software Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nApple (Sde)Uber (SDE)Oracle(SDE)Samsung (SDE)Taiwan Semiconductor\n\n## Insights on the Selection Process\nTest\n\n##  Preparation Resources\nStriver dsa sheetsKrishna X YouTube channel\n\n## Advice for students (dos and don’ts)? \nStart the preparation earlierBe consistent in what you are doing.Concentrate on your projects.\n\n",
    "meta": {
      "title": "Tanikella Sai Kiran: Placed at Intel",
      "description": "Tanikella Sai Kiran: Intel(Software Engineer)",
      "date": "2023-09-14",
      "tags": "Software Engineer,Intel,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-utkarsh-eaton",
    "content": "\nUtkarsh, studying in IIT Kanpur as a MT student in ME(SMD) will be joining Eaton as Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nGE Aviation, Quest global\n\n## Insights on the Selection Process\nResume shortlistTechnical interviewHR interview\n\n##  Preparation Resources\nBooks, notes, YouTube that’s all you need\n\n## Advice for students (dos and don’ts)? \nKnow your resume and your subjects\n\n",
    "meta": {
      "title": "Utkarsh: Placed at Eaton",
      "description": "Utkarsh: Eaton(Engineer)",
      "date": "2023-09-14",
      "tags": "Engineer,Eaton,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-utkarsh-verma-sprinklr",
    "content": "\nUtkarsh Verma, studying in IIT Kanpur as a BT(Double Major) student in CHE will be joining Sprinklr as Associate Product Manager. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nBain-(Associate)Flipkart(APM)AnM(Associate)Capital One(Business Analyst)Avendus (Investment Banker)American Exp(Analyst)Groww(APM)Nomura\n\n## Insights on the Selection Process\nTest + Resume based Shortlist3 Rounds of technical Interview1 HR Round\n\n##  Preparation Resources\nhttps://docs.google.com/document/d/1361vh1zuKTrCXR_DH0WVzJ1cBWjMWJHnpSqtg6jwTOs/edit#Books: (in order of priority)Preparing For Product Interviews - Advaith Sridhar (Practice Cases as Mock interview whenyou feel fairly confident in that category of cases)Decode and Conquer - Lewis C. Lin (Ch 1-10)Swipe to Unlock (Read this like a novel, helps you to be confident about the tech used in apps- this also helps in both RCA cases and Design cases to varying extent)Cracking the PM Interview - Gayle Laakmann - (Relevant Parts: Ch 10-15)The Product Manager Interview - Lewis C. Lin with Teng Lu (Ch 6, 11-18)Websites:https://medium.com/stellarpeersProduct Management Exercises: Master Your Product Manager Interview SkillsYou can practice product cases (even individually) from above two resources and thencompare your response to that given in the answer. Reading through the answers withoutgiving them a genuine shot beforehand will NOT help you extract the value out of theseresources.Youtube channels:ExponentPM SchoolThese resources are more than enough for a person targeting Product Profile.\n\n## Advice for students (dos and don’ts)? \nIn First two rounds they basically grill you and expect quick answers and round 3 is relativelymore relaxing.If you are shortlisted for multiple profiles in multiple industries for example consulting, productthen stick to only one rather than applying for each and every profile which will\n\n",
    "meta": {
      "title": "Utkarsh Verma: Placed at Sprinklr",
      "description": "Utkarsh Verma: Sprinklr(Associate Product Manager)",
      "date": "2023-09-14",
      "tags": "Associate Product Manager,Sprinklr,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-varun-soni-ford-motor",
    "content": "\nVarun Soni, studying in IIT Kanpur as a BT student in EE will be joining Ford Motor as Data Analyst (GDIA). Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nRakuten (Applications Engineer), Indus Analytics (Data Consultant), Navi (SDE/DS),MathWorks (SDE),\n\n## Insights on the Selection Process\nTest — Based on ML, probability and statistics (advanced stats questions were asked as well),aptitude and reasoning.\n\n##  Preparation Resources\nAndrew Ng is sufficient.\n\n## Advice for students (dos and don’ts)? \nDon’ts:Don’t push yourself to answer questions you have no idea about. There were advanced statsquestions which aren’t a part of MSO201A (probably the highest level of prob-stats many ofus study)Dos:Keep an eye on time allotted for each section and/or the entire paper. You might at time runout of time if you’re not fast enough.Revise your resume before interview based on what role the interview is for. This is whenyou’re sitting for multiple roles.\n\n",
    "meta": {
      "title": "Varun Soni: Placed at Ford Motor",
      "description": "Varun Soni: Ford Motor(Data Analyst (GDIA))",
      "date": "2023-09-14",
      "tags": "Data Analyst (GDIA),Ford Motor,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-veer-bhadra-yadav-sprinklr",
    "content": "\nVeer Bhadra Yadav, studying in IIT Kanpur as a BT student in ME will be joining Sprinklr as Data Scientist. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nSchlumberger (Ground trainee Engineer)ZodoZenon (Analytics)\n\n## Insights on the Selection Process\nCPI based shortlist for coding test (avg to hard Questions)Then test + resume-based shortlistRound 1- Resume Based questionsRound 2- Resume + DSA based questionsRound 3- Questions based on Data Science TheoryRound 4- HR Round (Sample HR Questions but asked in a tricky way)\n\n##  Preparation Resources\nProject Explanation--Problem Statement-Methods you used-Final ResultMost of the questions were related from the projectsFormulas like L1 regularization from linear regression etc.\n\n## Advice for students (dos and don’ts)? \nUse your words/technical terms during the interview wisely because the interviewer can godeep into it.Don’t be overconfident and use the language in which the interviewer speaks.Don’t give too much time to everything and clear the basics of things first even if you have notlearnt the advanced things.Create stories or prepare stories which support your points in resume.\n\n",
    "meta": {
      "title": "Veer Bhadra Yadav: Placed at Sprinklr",
      "description": "Veer Bhadra Yadav: Sprinklr(Data Scientist)",
      "date": "2023-09-14",
      "tags": "Data Scientist,Sprinklr,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-videh-aggarwal-morgan-stanley",
    "content": "\nVideh Aggarwal, studying in IIT Kanpur as a BT student in EE will be joining Morgan Stanley as Strats and Quants. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nWorld Quant – QuantSprinklr – SDEApple – SDE\n\n## Insights on the Selection Process\n1] Test2] Resume Shortlist3] Interview\n\n##  Preparation Resources\nCoding: LeetCode and Codeforces, do as many problems as possible.Probability and Stats: 50 challenging problems in Probability (Book) and A Practical Guide toQuantitative Finance Interviews (Book), Brainstellar (Website), Braingle (Website) andGurmi.net (Website).\n\n## Advice for students (dos and don’ts)? \nDos: Do as much Coding as possible, try to maintain balance between CPI, coding. Try tonarrow out the profiles you are targeting. Do study CS fundamentals which (in priority order)are OOPS, OS, DBMS and Computer Network.Don’ts: Don’t take the internship season lightly.\n\n",
    "meta": {
      "title": "Videh Aggarwal: Placed at Morgan Stanley",
      "description": "Videh Aggarwal: Morgan Stanley(Strats and Quants)",
      "date": "2023-09-14",
      "tags": "Strats and Quants,Morgan Stanley,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-yash-burnwal-nomura",
    "content": "\nYash Burnwal, studying in IIT Kanpur as a BT student in MTH will be joining Nomura as Algo Trading. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\nBain-ConsultingWorld QuantAlvarez and MarsalArthur D Little\n\n## Insights on the Selection Process\n1) Resume Shortlist2) Test3) Interview (Tech and HR)\n\n##  Preparation Resources\nDSA, Linear Regression and Puzzles questions.\n\n## Advice for students (dos and don’ts)? \nDon’ts: Don’t just focus on consulting, have a backup as well. No need to give more than 1month for consulting preparation.\n\n",
    "meta": {
      "title": "Yash Burnwal: Placed at Nomura",
      "description": "Yash Burnwal: Nomura(Algo Trading)",
      "date": "2023-09-14",
      "tags": "Algo Trading,Nomura,Placement",
      "imageUrl": ""
    }
  },
  {
    "slug": "2023-placement-yogesh-kumar-baswal-qualcomm-india-private-limited",
    "content": "\nYogesh Kumar Baswal, studying in IIT Kanpur as a MT student in EE(SPCOM) will be joining Qualcomm India Private Limited as Hardware Engineer. Here are some brief insights of his.\n\n## Shortlisted Profiles & Companies:\n1. Qualcomm (Selected)2. Intel3. Samsung4. STMicroelectronics5. Cisco\n\n## Insights on the Selection Process\n1. Written Test – comprised of 3 sections :1.1. Aptitude1.2. C MCQs1.3. Technical\n\n##  Preparation Resources\n1. Digital electronics gate syllabus and problem-solving DIGI_QS PDF2. Youtube lect. of Digital IC design by Prof. janakiraman3. Youtube lect on verilog by indranil sengupta and Verilog HDL Book by Samir Palnitkar4. C MCQ from GFG (required only for written test )5. Other- FIFO, youtube lect. on STA by yash jain-setup and hold violation, metastability,clock gating, low power design\n\n## Advice for students (dos and don’ts)? \nStart your preparation early to not panic at the last moment. Gather all the materials fromseniors and plan accordingly. For written tests, practice from PYQs. Give enough time tograsp the concepts of digital ic design, and keep revising. Be thorough with your resume, andinclude some VLSI-related projects in it (more projects will be advantageous).Don&#39;t panic in the interview, interviewers are going to help you. They don&#39;t expect a fullycorrect answer from you, but they see your approach. Just be confident while answering.Don&#39;t compare yourself with others. Work Hard, and Be Consistent.\n\n",
    "meta": {
      "title": "Yogesh Kumar Baswal: Placed at Qualcomm India Private Limited",
      "description": "Yogesh Kumar Baswal: Qualcomm India Private Limited(Hardware Engineer)",
      "date": "2023-09-14",
      "tags": "Hardware Engineer,Qualcomm India Private Limited,Placement",
      "imageUrl": ""
    }
  }
    ]
}
}